Repository: pkp/openid
Catalog: locale/*/locale.po
Languages: cs_cz, da, de, es, fr_ca, hy, mk_mk, pt, pt_br, ru_ru, sl_si, uk

# plugins.generic.openid.settings.orcid.desc
source: Please use this redirect URL (see <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>tutorial</a>):
cs_cz: Použijte, prosím, toto URL přesměrování (viz <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>tutorial</a>):
da: Brug denne redirect-URL (se <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>vejledning</a>):
de: Verwenden Sie bitte diese Redirect-URL (<a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>Link zum Tutorial</a>):
es: Use esta URL de redireccionamiento (consulte el <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>tutorial</a>):
hy: Խնդրում ենք օգտագործել այս վերահղման URL-ը (տես <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>ձեռնարկ</a>):
mk_mk: Молам користи ја оваа пренасочена УРЛ (see <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>tutorial</a>):
pt: Use o URL de redirecionamento (ver <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>tutorial</a>):
pt_br: Utilize esta URL de redirecionamento (consulte <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>tutorial </a>):
ru_ru: Пожалуйста, используйте этот URL перенаправления (см. <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>руководство</a>):
sl_si: Prosimo uporabite ta povezovalni URL (glej <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>navodila</a>):
uk: Будь ласка, використовуйте цю URL-адресу перенаправлення (див. <a href='https://github.com/ORCID/ORCID-Source/blob/master/orcid-web/ORCID_AUTH_WITH_OPENID_CONNECT.md' target='_blank' rel='noopener'>підручник</a>):

# plugins.generic.openid.settings.clientSecret.desc
source: Please enter your client secret.
cs_cz: Vložte, prosím, váš "client secret".
da: Indtast din hemmelige klient-nøgle.
de: Bitte geben Sie hier Ihre client secret ein
es: Introduzca su contraseña secreta de cliente.
hy: Խնդրում ենք մուտքագրել ձեր հաճախորդի գաղտնիքը:
mk_mk: Молам внесете ја тајната на вашиот клиент.
pt: Insira o seu segredo de cliente.
pt_br: Insira o segredo do seu cliente.
ru_ru: Пожалуйста введите ваш секретный ключ клиента (client secret).
sl_si: Prosimo vnesite secret klienta.
uk: Будь ласка, введіть ваш секрет клієнта.

# plugins.generic.openid.settings.features.head
source: Advanced plugin functions
cs_cz: Pokročilé funkce pluginu
da: Avancerede plugin-funktioner
de: Erweiterte Plugin-Funktionen
es: Funciones avanzadas del módulo
hy: Ընդլայնված plugin գործառույթներ
mk_mk: Напредни функции на плагинот
pt: Funções avançadas do plugin
pt_br: Funções avançadas de plugin
ru_ru: Дополнительные функции плагина
sl_si: Napredne funkcije vtičnika
uk: Розширені функції плагіна

# plugins.generic.openid.settings.legacyLogin
source: Legacy Login
cs_cz: Starší přihlášení
da: Ældre login
de: Default OJS Login
es: Inicio de sesión antiguo
hy: Մուտք հին ձևով
mk_mk: Легално логирање
pt: Acesso ao legado
pt_br: Login legado
ru_ru: «Старый» способ входа
sl_si: Stara prijava
uk: Успадкований логін

# plugins.generic.openid.error.openid.disabled.with
source: <strong>This account is disabled for the following reason:</strong>
cs_cz: <strong>Tento účet je deaktivován z následujícího důvodu: </strong>
da: <strong>Denne konto er deaktiveret af følgende årsag:</strong>
de: <strong>Dieser Account wurde aus folgendem Grund deaktiviert:</strong>
es: <strong>Esta cuenta se ha desactivado por el siguiente motivo:</strong>
hy: <strong>Այս հաշիվն անջատված է հետևյալ պատճառով:</strong>
mk_mk: <strong>Овој акаунт е онеспособен поради следни причини:</strong>
pt: <strong>Esta conta está desativada pela seguinte razão:</strong>
pt_br: <strong> Esta conta foi desativada pelo seguinte motivo: </strong>
ru_ru: <strong>Эта учётная запись отключена по следующей причине:</strong>
sl_si: <strong>Ta račun je onemogočen zaradi:</strong>
uk: <strong>Цей обліковий запис вимкнено з такої причини:</strong>

# plugins.generic.openid.settings.configUrl.desc
source: Please enter the configuration URL of your OpenID provider.<strong>The URL must end with ".well-known/openid-configuration" (e.g. "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
cs_cz: Zadejte adresu URL konfigurace vašeho poskytovatele OpenID. <strong> Adresa URL musí končit příponou ".well-known/openid-configuration" (např. https://sso.example.com/auth/realms/master/.well-known/openid-configuration"). </strong>
da: Indtast konfigurations-URL'en til din OpenID-udbyder.<strong>URL'en skal slutte med ".well-known/openid-configuration" (f.eks. "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
de: Bitte geben Sie die Konfigurations-URL Ihres OpenID-Anbieters ein. <strong>Die URL muss mit ".well-known/openid-configuration" (z.B. "https://sso.example.com/auth/realms/master/.well-known/openid-configuration") enden.</strong>
es: Introduzca la configuración URL de su proveedor OpenID.<strong>La URL debe acabar con ".well-known/openid-configuration" (p.ej.: "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
hy: Խնդրում ենք մուտքագրել ձեր OpenID մատակարարի կազմաձևման URL-ը:<strong>URL-ը պետք է ավարտվի ".well-known/openid-configuration" (օրինակ՝ "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
mk_mk: Внесете го конфигурациското УРЛ ан вашиот ОпенИД провајдер.<strong>УРЛ-то мора да завршува со ".well-known/openid-configuration" (на пр. "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
pt: Insira o URL de configuração para o seu fornecedor OpenID. <strong>O URL deve terminar com ".well-known/openid-configuration" (ex.: "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
pt_br: Insira a URL de configuração do seu provedor de OpenID. <strong> A URL deve terminar com ".well-known/openid-configuration" (por exemplo, "https://sso.example.com/auth/realms/master/.well-known/openid-configuration"). </strong>
ru_ru: Пожалуйста, введите URL конфигурации вашего провайдера OpenID.<strong>URL должен заканчиваться на «.well-known/openid-configuration» (например, «https://sso.example.com/auth/realms/master/.well-known/openid-configuration»).</strong>
sl_si: Prosimo vnesite nastavitveni URL vašega OpenID ponudnika. <strong>URL se mora končati z ".well-known/openid-configuration" (npr. "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>
uk: Введіть URL-адресу конфігурації вашого постачальника послуг OpenID. <strong>URL-адреса має закінчуватися на ".well-known/openid-configuration" (наприклад, "https://sso.example.com/auth/realms/master/.well-known/openid-configuration").</strong>

# plugins.generic.openid.settings.features.enable.provider.sync
source: Enable OpenID provider user data synchronization
cs_cz: Povolte synchronizaci uživatelských dat poskytovatele OpenID
da: Aktivér synkronisering af brugerID for OpenID-udbyder
de: Aktivieren der OpenID-Provider-Benutzerdatensynchronisation
es: Activar la sincronización de datos de usuario/a del proveedor OpenID
hy: Միացնել OpenID մատակարարի օգտատիրոջ տվյալների համաժամացումը
mk_mk: Овозможува синхронизација на податоци од ОпенИД обезбедувачот
pt: Ativar sincronização de dados de utilizador com o fornecedor OpenID
pt_br: Habilitar sincronização de dados de usuário do provedor OpenID
ru_ru: Включить синхронизацию данных пользователя с провайдером OpenID
sl_si: Omogoči sinhronizacijo uporabniških podatkov z OpenID ponudnikom
uk: Увімкнути синхронізацію даних користувачів постачальника OpenID

# plugins.generic.openid.settings.features.disable.fields.desc
source: Prevent the following fields from being modified within this application:
cs_cz: Zabraňte úpravám následujících polí v této aplikaci:
da: Undgå, at følgende felter kan ændres i denne applikation:
de: Sperren Sie die folgenden Felder gegen eine Änderung innerhalb dieser Anwendung:
es: Evitar que los campos siguientes se modifiquen en la aplicación:
hy: Կանխել հետևյալ դաշտերի փոփոխումը այս հավելվածում:
mk_mk: Ги заштитува следните полиња од модифицирање во оваа апликација:
pt: Impedir que os seguintes campos sejam modificados nesta aplicação:
pt_br: Evite que os seguintes campos sejam modificados nesta aplicação:
ru_ru: Запретить модификацию следующих полей внутри данного приложения:
sl_si: Prepreči spreminjanje naslednjih polj preko te aplikacije:
uk: Заборонити змінення таких полів у цій програмі:

# plugins.generic.openid.select.provider
source: Sign in or register
cs_cz: Přihlaste se nebo se zaregistrujte
da: Log ind eller registrer
de: Anmelden oder registrieren
es: Iniciar sesión o registrarse
hy: Մուտք գործեք կամ գրանցվեք
mk_mk: Запиши се или регистрирај се
pt: Aceder ou registar
pt_br: Entrar ou Registrar
ru_ru: Войти в систему или зарегистрироваться
sl_si: Registracija ali prijava
uk: Увійти або зареєструватися

# plugins.generic.openid.form.error.usernameOrEmail.required
source: A username or email is required.
cs_cz: Je vyžadováno uživatelské jméno nebo email.
da: Der kræves et brugernavn eller en e-mail.
de: Nutzername oder E-Mail-Adresse benötigt.
es: Es obligatorio un nombre de usuario/a o un correo electrónico.
fr_ca: Un nom d'utilisateur ou un courriel est requis.
hy: Պահանջվում է օգտանուն կամ էլ. փոստ:
mk_mk: Потребно е корисничко име или имејл.
pt: É obrigatório inserir um nome de utilizador ou e-mail.
pt_br: É necessário um nome de usuário ou e-mail.
ru_ru: Имя пользователя или адрес почты обязателен.
sl_si: Uporabniško ime ali email je obvezen.
uk: Ім'я користувача або електронна пошта обов'язкові.

# plugins.generic.openid.form.error.password.required
source: A password is required.
cs_cz: Je vyžadováno heslo.
da: Et password er påkrævet.
de: Passwort erforderlich.
es: Es obligatoria una contraseña.
fr_ca: Un mot de passe est requis.
hy: Պահանջվում է գաղտնաբառ:
mk_mk: Потребен е пасворд (лозинка).
pt: É obrigatório inserir uma senha.
pt_br: É necessária uma senha.
ru_ru: Пароль обязателен.
sl_si: Geslo je obvezno.
uk: Пароль обов'язковий.

# plugins.generic.openid.form.error.user.not.found
source: No user was found that matches your credentials.
cs_cz: Nebyl nalezen žádný uživatel, který by odpovídal vašim přihlašovacím údajům.
da: Der blev ikke fundet en bruger, der matcher dine brugeroplysninger.
de: Es konnte kein Benutzer gefunden werden, der mit Ihren Anmeldedaten übereinstimmt.
es: No se ha encontrado ningún usuario/a que coincida con estas credenciales.
hy: Ձեր հավատարմագրերին համապատասխան օգտատեր չի գտնվել:
mk_mk: Не е најден корисник кој ги спарува твоите податоци.
pt: Não foi encontrado um utilizador com as suas credenciais.
pt_br: Nenhum usuário foi encontrado que corresponda às suas credenciais.
ru_ru: Пользователь с такими данными для входа не найден.
sl_si: Uporabnika s podanimi podatki ni bilo mogoče najti.
uk: Не знайдено жодного користувача, який би відповідав Вашим обліковим даним.

# plugins.generic.openid.settings.openid.head
source: OpenId Provider:
cs_cz: Poskytovatel OpenID:
da: OpenId-udbyder:
de: OpenId Anbieter:
es: Proveedor de OpenID:
hy: OpenId մատակարար:
mk_mk: ОпенИД провајдер:
pt: Fornecedor OpenID:
pt_br: Provedor OpenId:
ru_ru: Провайдер OpenID:
sl_si: OpenId ponudnik:
uk: Постачальник OpenID:

# plugins.generic.openid.settings.custom.enable
source: Custom OpenID Provider
cs_cz: Vlastní poskytovatel OpenID
da: Brugerdefineret OpenID-udbyder
de: Benutzerdefinierter OpenID Anbieter
es: Proveedor OpenID personalizado
hy: Անհատականացված OpenID մատակարար
mk_mk: Сопствен ОпенИД провајдер
pt: Fornecedor de OpenID personalizado
pt_br: Provedor OpenID personalizado
ru_ru: Пользовательский провайдер OpenID
sl_si: OpenID ponudnik po meri
uk: Настроюваний постачальник OpenID

# plugins.generic.openid.settings.btn.settings
source: Custom login button settings
cs_cz: Vlastní nastavení tlačítka pro přihlášení
da: Indstillinger for brugerdefineret login-knap
de: Einstellungen für den benutzerdefinierten Login-Button
es: Ajustes personalizados del botón de inicio de sesión
hy: Անհատականացված մուտքի կոճակի կարգավորումներ
mk_mk: Сопствени поставки за копчето за пријавување
pt: Configurações de botões de acesso personalizadas
pt_br: Configurações personalizadas do botão de login
ru_ru: Настройки пользовательской кнопки входа
sl_si: Nastavitve za gumb za prijavo po meri
uk: Налаштування користувацької кнопки входу

# plugins.generic.openid.settings.provider.settings
source: Login credentials
cs_cz: Přihlašovací údaje
da: Loginoplysninger
de: Anmeldeinformationen
es: Credenciales de acceso
hy: Մուտքի հավատարմագրերը
mk_mk: Акредитиви за пријавување
pt: Credenciais de acesso
pt_br: Credenciais de login
ru_ru: Параметры входа
sl_si: Poverilnice za prijavo
uk: Облікові дані для входу

# plugins.generic.openid.settings.btnTxt.desc
source: Please enter the label of the login button.
cs_cz: Zadejte, prosím, popis přihlašovacího tlačítka.
da: Indtast etiketten på login-knappen.
de: Bitte geben Sie die Beschriftung des Login-Buttons ein.
es: Introduzca la etiqueta del botón de inicio de sesión.
hy: Խնդրում ենք մուտքագրել մուտքի կոճակի պիտակը:
mk_mk: Ве молиме да ја внесете ознаката за копчето за најава.
pt: Insira a etiqueta para o botão de acesso.
pt_br: Por favor, insira o rótulo do botão de login.
ru_ru: Пожалуйста, введите текст для кнопки входа.
sl_si: Prosimo vnesite napis za gumb za prijavo.
uk: Будь ласка, введіть мітку кнопки входу.

# plugins.generic.openid.settings.orcid.enable
source: ORCID OpenID Connect
cs_cz: ORCID OpenID přihlášení
es: Conector OpenID ORCID
mk_mk: Поврзување со ОРЦИД ОпенИД
pt: Conectar por ORCID Open ID
sl_si: Poveži ORCID OpenID

# plugins.generic.openid.settings.google.enable
source: Google OpenID Connect
cs_cz: Google OpenID připojení
es: Conector OpenID Google
mk_mk: Поврзување со Google ОпенИД
pt: Conectar por Google OpenID
sl_si: Poveži Google OpenID

# plugins.generic.openid.settings.apple.enable
source: Apple ID
es: ID de Apple
fr_ca: Identifiant Apple
mk_mk: Apple ИД

# plugins.generic.openid.settings.apple.desc
source: See this <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>tutorial</a> on how to configure Apple ID. Please use this redirect URL:
cs_cz: Přečtěte si tento <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'> tutorial </a>, jak konfigurovat Apple ID. Použijte prosím tuto adresu URL přesměrování:
da: Se denne <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>vejledning</a> om, hvordan du konfigurerer Apple-ID. Brug denne redirect-URL:
de: <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>Hier</a> erfahren Sie, wie Sie die Apple ID konfigurieren. Bitte verwenden Sie diese Redirect-URL:
es: Consulte este <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>tutorial</a> sobre cómo configurar el ID Apple. Use esta URL de redireccionamiento:
hy: Տես սա <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>ձեռնարկ</a> թե ինչպես կարգավորել Apple ID-ն: Խնդրում ենք օգտագործել վերահղման այս URL-ը:
mk_mk: Погледнете го следното <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>упатство</a> за кофигурација на Apple ИД. Ве молиме да го употребите следното УРЛ за пренасочување:
pt: Veja este <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>tutorial</a> sobre como configurar o seu Apple ID. Use este URL de redirecionamento:
pt_br: Consulte este <a href='https://developer.apple.com/documentation/authenticationervices' target='_blank' rel='noopener'> tutorial </a> sobre como configurar o Apple ID. Use este URL de redirecionamento:
ru_ru: Прочтите это <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>руководство</a>, чтобы узнать как настроить Apple ID. Пожалуйста, используйте этот URL перенаправления:
sl_si: Kako nastavite Apple ID lahko vidite v teh <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>navodilih</a>. Prosimo uporabite ta URL:
uk: Дивіться цей <a href='https://developer.apple.com/documentation/authenticationservices' target='_blank' rel='noopener'>підручник</a> про те, як налаштувати Apple ID. Будь ласка, використовуйте цю URL-адресу перенаправлення:

# plugins.generic.openid.settings.clientId
source: Client identifier
cs_cz: Identifikátor klienta
da: Klient-id
es: Identificador del cliente
hy: Հաճախորդի նույնացուցիչ
mk_mk: Идентификатор за клиент
pt: Identificador de Cliente
pt_br: Identificador de cliente
ru_ru: Идентификатор клиента
sl_si: identifikator klienta
uk: Ідентифікатор клієнта

# plugins.generic.openid.settings.clientId.desc
source: Please enter your clientId.
cs_cz: Vložte, prosím, vaše clientId.
da: Indtast din klient-id.
de: Bitte geben Sie hier ihre clientId ein
es: Introducir su identificador de cliente (clientID).
hy: Խնդրում ենք մուտքագրել ձեր clientId -ին.
mk_mk: Ве молиме да го внесете вашето ИД на клиент.
pt: Insira o seu clientId.
pt_br: Por favor, insira seu clientId.
ru_ru: Пожалуйста, введите ваш clientId.
sl_si: Prosimo vnesite vaš clientId.
uk: Будь ласка, введіть свій clientId.

# plugins.generic.openid.settings.clientSecret
source: Client secret
da: Hemmelig klient-nøgle
es: Contraseña secreta del cliente
hy: Հաճախորդի գաղտնիք
mk_mk: Тајна на клиентот
pt: Segredo de cliente
pt_br: Segredo do cliente
ru_ru: Секретный ключ клиента
sl_si: Secret klienta
uk: Секрет клієнта

# plugins.generic.openid.settings.features.desc
source: The following fields are optional. They are not required to connect to an OpenID provider.
cs_cz: Následující pole jsou volitelná. Nejsou požadována pro připojení k poskytovateli OpenID.
da: De følgende felter er valgfri. De er ikke påkrævet for at oprette forbindelse til en OpenID-udbyder.
de: Die folgenden Felder sind optional. Sie sind nicht erforderlich, um eine Verknüpfung mit einem OpenID-Anbieter herzustellen.
es: Los campos siguientes son opcionales. No son obligatorios para conectarse a un proveedor OpenID.
hy: Հետևյալ դաշտերը պարտադիր չեն: Նրանցից չի պահանջվում միանալ OpenID-ի մատակարարին:
mk_mk: Следните полиња се изборни. Не се задолжителни за конектирање со ОпенИД провајдер.
pt: Os campos seguintes são opcionais. Não são obrigatórios para conectar a um fornecedor OpenID.
pt_br: Os campos a seguir são opcionais. Eles não são necessários para se conectar a um provedor OpenID.
ru_ru: Следующие поля являются необязательными, они не требуются для подключения к провайдеру OpenID.
sl_si: Naslednja polja so neobvezna. Polja niso zahtevana za povezavo z OpenID ponudnikom.
uk: Такі поля необов'язкові. Вони не потрібні для підключення до постачальника OpenID.

# plugins.generic.openid.settings.legacyLogin.check
source: Enable legacy login
cs_cz: Dovolit starší způsob přihlášení
da: Aktivér ældre login
de: Default OJS Login aktivieren
es: Activar el inicio de sesión antiguo
hy: Թույլատրել մուտքը հին ձևով
mk_mk: Овозможи легано логирање
pt: Ativar acesso ao legado
pt_br: Habilitar login legado
ru_ru: Включить «старый» способ входа
sl_si: Omogoči staro prijavo
uk: Увімкнути успадкований логін

# plugins.generic.openid.settings.legacyLogin.desc
source: Enable this option if you want users to be able to login with the application's login form in addition to the OpenID logon.
cs_cz: Tuto možnost povolte, pokud chcete, aby se uživatelé kromě přihlášení OpenID mohli registrovat a přihlásit i pomocí přihlašovacího formuláře aplikace.
da: Aktivér denne mulighed, hvis du vil have, at brugerne skal kunne registrere og logge ind med applikationens loginformular ud over OpenID-login.
de: Aktivieren Sie diese Option, wenn Sie möchten, dass sich die Benutzer zusätzlich zur OpenID-Anmeldung auch mit dem default Anmeldeformular der Anwendung registrieren und anmelden können.
es: Active esta opción si quiere que los usuarios/as puedan iniciar sesión con el formulario de acceso de la aplicación además de con el inicio de sesión de OpenID.
hy: Միացրեք այս տարբերակը, եթե ցանկանում եք, որ օգտատերերը բացի OpenID մուտքից, կարողանան գրանցվել և մուտք գործել հավելվածի մուտքի ձևով:
mk_mk: Овозможете ја оваа опција доколку сакате корисниците да можат да се регистрираат и најавуваат и преку формуларот за најава на апликацијата покрај најавата на ОпенИД.
pt: Ative esta opção se pretende que os utilizadores possam registar-se e aceder através do formulário de registo de acesso adicionalmente ao acesso por OpenID.
pt_br: Habilite esta opção se quiser que os usuários possam se registrar e fazer login com o formulário de login do aplicativo, além do login OpenID.
ru_ru: Включите этот параметр, если хотите чтобы пользователи могли регистрироваться и входить в систему, используя форму входа приложения, помимо входа через OpenID.
sl_si: To opcijo vklopite, če želite, da se uporabniki lahko registrirajo in prijavijo s prijavo v aplikacijo poleg OpenID prijave.
uk: Увімкніть цю опцію, якщо хочете, щоб користувачі могли реєструватися та входити за допомогою форми входу в програму на додачу до входу в систему OpenID.

# plugins.generic.openid.settings.legacyRegister.check
source: Enable legacy registration
da: Aktiver gammel registrering ('legacy registration')
de: Registrierung von Altdaten aktivieren
es: Activar el registro antiguo
hy: Միացնել ժառանգության գրանցումը
pt: Ativar registo legado
pt_br: Habilitar registro legado
uk: Увімкнути застарілу реєстрацію

# plugins.generic.openid.settings.hashSecret
source: Encrypt/Decrypt secret
cs_cz: Šifrovací/dešifrovací tajemství (Encrypt/Decrypt secret)
da: Krypter/dekrypter 'secret'
de: Passwort zum Verschlüsseln/Entschlüsseln
es: Encriptar/desencriptar la contraseña secreta
hy: Գաղտնագրել/գաղտնազերծել գաղտնիքը
mk_mk: Енкриптирана/декриптирана тајна
pt: Segredo encriptado/desencriptado
pt_br: Criptografar/descriptografar segredo
ru_ru: Секретный ключ для шифрования/дешифрования
uk: Шифрування / розшифрування секрета

# plugins.generic.openid.settings.generateAPIKey
source: Automated API Key
cs_cz: Automatizovaný klíč API
da: Automatiseret API-nøgle
de: Automatischer API-Schlüssel
es: Clave API automatizada
hy: Ավտոմատացված API բանալի
mk_mk: Автоматски АПИ клуч
pt: API Key Automatizada
pt_br: Chave de API automatizada
ru_ru: Автоматизированный ключ API
sl_si: Avtomatski API ključ
uk: Автоматизований ключ API
