Repository: pkp/openid
Catalog: locale/*/locale.po
Languages: cs_cz, da, de, es, fr_ca, hy, mk_mk, pt, pt_br, ru_ru, sl_si, uk

# plugins.generic.openid.form.error.email.required
source: An email is required.
cs_cz: Je vyžadován email.
da: Der kræves en e-mail.
de: E-Mail-Adresse benötigt
es: Se requiere un correo electrónico.
fr_ca: Un courriel est requis.
hy: Պահանջվում է էլ. փոստ:
mk_mk: Потребен е имејл.
pt: É obrigatório inserir um e-mail.
pt_br: É necessário um e-mail.
ru_ru: Адрес электронной почты обязателен.
sl_si: Email je obvezen.
uk: Електронна пошта обов'язкова.

# plugins.generic.openid.form.error.affiliation.required
source: An affiliation is required.
cs_cz: Je vyžadována vaše afiliace.
da: En tilknytning er påkrævet.
de: Affiliation benötigt.
es: Se requiere una afiliación.
fr_ca: Une affiliation est requise.
hy: Պահանջվում է պատկանելություն:
mk_mk: Потребно е вработување.
pt: É obrigatório inserir a afiliação.
pt_br: É necessária uma afiliação.
ru_ru: Аффилиация обязательна.
sl_si: Ustanova je obvezna.
uk: Афіліація обов'язкова.

# plugins.generic.openid.form.error.country.required
source: A country is required.
cs_cz: Je požadováno uvedení země.
da: Et land er påkrævet.
de: Nationalität benötigt
es: Se requiere un país.
fr_ca: Un pays est requis.
hy: Պահանջվում է երկիր.
mk_mk: Потребна е земја.
pt: É obrigatório inserir um país.
pt_br: É necessário um país.
ru_ru: Страна обязательна.
sl_si: Država je obvezna.
uk: Країна обов'язкова.

# plugins.generic.openid.form.error.familyName.required
source: A family name is required.
cs_cz: Příjmení je povinné.
da: Der kræves et efternavn.
de: Nachname benötigt
es: Se requiere un apellido.
fr_ca: Un nom de famille est requis.
hy: Պահանջվում է ազգանուն:
mk_mk: Потребно е презиме.
pt: É obrigatório inserir um apelido.
pt_br: É necessário um sobrenome.
ru_ru: Фамилия обязательна.
sl_si: Priimek je obvezen.
uk: Прізвище обов'язкове.

# plugins.generic.openid.form.error.givenName.required
source: A given name is required.
cs_cz: Křestní jméno je povinné.
da: Et fornavn er påkrævet.
de: Vorname benötigt.
es: Se requiere un nombre de pila.
fr_ca: Un prénom est requis.
hy: Պահանջվում է անուն:
mk_mk: Потребно е лично име.
pt: É obrigatório inserir um nome próprio.
pt_br: É necessário um nome.
ru_ru: Имя обязательно.
sl_si: Ime je obvezno.
uk: Ім'я обов'язкове.

# plugins.generic.openid.form.error.usernameExists
source: The username you provided already exists.
cs_cz: Zadané uživatelské jméno již existuje.
da: Det brugernavn, du har angivet, findes allerede.
de: Der gewünschte Benutzername ist bereits vergeben.
es: El nombre de usuario que has proporcionado ya existe.
fr_ca: Le nom d'utilisateur existe déjà.
hy: Ձեր տրամադրած օգտանունն արդեն գոյություն ունի:
mk_mk: Корисничкото име кое го даде веќе постои.
pt: O nome de utilizador que inseriu já existe.
pt_br: O nome de usuário fornecido já existe.
ru_ru: Имя пользователя, указанное Вами, уже существует.
sl_si: Uporabniško ime že obstaja.
uk: Ім'я користувача, яке Ви вказали, уже існує.

# plugins.generic.openid.form.error.username.required
source: A username is required.
cs_cz: Je požadováno uživatelské jméno.
da: Et brugernavn er påkrævet.
de: Benutzername benötigt.
es: Se requiere un nombre de usuario/a.
fr_ca: Un nom d'utilisateur est requis.
hy: Պահանջվում է օգտանուն.
mk_mk: Потребно е корисничко име.
pt: É obrigatório um nome de utilizador.
pt_br: É necessário um nome de usuário.
ru_ru: Имя пользователя обязательно.
sl_si: Uporabniško ime je obvezno.
uk: Ім'я користувача обов'язкове.

# plugins.generic.openid.step2.connect.btn
source: Login and connect accounts
cs_cz: Přihlaste se a připojte účty
da: Log ind og tilslut konti
de: Anmelden und Benutzerkonten verbinden
es: Iniciar sesión y conectar cuentas
fr_ca: Se connecter et connecter les comptes
hy: Մուտք գործեք և միացրեք հաշիվները
mk_mk: Логирај се и поврзи се со акаунти
pt: Acesse a sua conta e conecte as contas
pt_br: Entrar e conectar contas
ru_ru: Войти в систему и связать учётные записи
sl_si: Prijavi se in poveži računa
uk: Увійти та пов'язати облікові записи

# plugins.generic.openid.step2.connect.username
source: Username or email
cs_cz: Uživatelské jméno či email
da: Brugernavn eller e-mail
de: Nutzername oder E-Mail-Adresse
es: Nombre de usuario/a o correo electrónico
fr_ca: Nom d'utilisateur-trice ou courriel
hy: Օգտանուն կամ էլ. փոստ
mk_mk: Корисничко или имејл
pt: Nome de utilizador ou e-mail
pt_br: Nome de usuário ou e-mail
ru_ru: Имя пользователя или адрес почты
sl_si: Uporabniško ime ali email
uk: Ім'я користувача або електронна пошта

# plugins.generic.openid.step2.connect
source: Please login to your account at {$journalName}.<br />Your information will be updated automatically.
cs_cz: Přihlaste se prosím ke svému účtu u {$journalName}. <br /> Vaše údaje budou automaticky aktualizovány.
da: Log ind på din konto hos {$journalName}.<br />Dine oplysninger opdateres automatisk.
de: Bitte melden Sie sich mit Ihrem Benutzerkonto auf {$journalName} an.<br /> Ihre Informationen werden automatisch aktualisiert.
es: Por favor, accede a tu cuenta en {$journalName}.<br />Tu información se actualizará automáticamente.
fr_ca: S'il vous plaît, connectez vous à votre compte sur {$journalName}.<br />Votre information sera mise à jour automatiquement.
hy: Խնդրում ենք մուտք գործել ձեր հաշիվ {$journalName} հասցեով:<br />Ձեր տեղեկությունները ինքնաշխատ կերպով կթարմացվեն:
mk_mk: Молам логирај се на твојот акаунт на {$journalName}.<br />Твоите информации ќе бидат автоматски обновени.
pt: Entre na sua conta em {$journalName}.<br />A sua informação será atualizada automaticamente.
pt_br: Faça login em sua conta em {$journalName}. <br /> Suas informações serão atualizadas automaticamente.
ru_ru: Пожалуйста, войдите в свою учётную запись в «{$journalName}».<br />Ваша информация будет автоматически обновлена.
sl_si: Prosimo prijavite se v {$journalName}.<br />Vapi podtki se bodo posodobili avtomatično.
uk: Будь ласка, увійдіть у свій обліковий запис у "{$journalName}".<br />Вашу інформацію буде оновлено автоматично.

# plugins.generic.openid.step2.complete.btn
source: Complete registration
cs_cz: Dokončit registraci
da: Fuldfør registrering
de: Registrierung abschließen
es: Registro completado
fr_ca: Inscription terminée
hy: Լրիվ գրանցում
mk_mk: Комплетна регистрација
pt: Registo concluído
pt_br: Registro completo
ru_ru: Завершить регистрацию
sl_si: Končaj registracijo
uk: Завершіть реєстрацію

# plugins.generic.openid.step2.complete
source: Please verify your details and add any missing information
cs_cz: Zkontrolujte prosím své údaje a přidejte všechny chybějící informace
da: Bekræft dine oplysninger, og tilføj eventuelle manglende oplysninger
de: Bitte überprüfen Sie Ihre Angaben und ergänzen Sie eventuell fehlende Informationen
es: Por favor, verifica tus datos y añade cualquier información que falte
fr_ca: S'il vous plaît, vérifiez les détails et ajouter toute information manquante
hy: Խնդրում ենք ստուգել ձեր տվյալները և ավելացնել ցանկացած բացակայող տեղեկություն
mk_mk: Молам потврди ги твоите детали и додади информација која недостасува
pt: Verifique os seus detalhes e adicione qualquer informação em falta
pt_br: Por favor verificar os seus dados e adicione qualquer informação inexistente
ru_ru: Пожалуйста, проверьте данные и внесите ту информацию, которая отсутствует
sl_si: Prosimo preverite podrobnosti in dodajte manjkajoče informacije
uk: Будь ласка, перевірте свої дані та додайте будь-яку відсутню інформацію

# plugins.generic.openid.step2.choice.yes
source: Yes, I already have an account.
cs_cz: Ano, již mám účet.
da: Ja, jeg har allerede en konto.
de: Ja, ich habe bereits ein Benutzerkonto.
es: Sí, ya tengo una cuenta.
fr_ca: Oui, j'ai déjà un compte utilisateur.
hy: Այո, ես արդեն ունեմ հաշիվ:
mk_mk: Да, јас веќе имам акаунт.
pt: Sim, já possuo um registo.
pt_br: Sim, já tenho uma conta.
ru_ru: Да, у меня уже есть учётная запись.
sl_si: Ja, račun že imam.
uk: Так, у мене вже є обліковий запис.

# plugins.generic.openid.step2.choice.no
source: No, I'm new to {$journalName}.
cs_cz: Ne, jsem v {$ journalName} nový.
da: Nej, jeg er ny hos {$journalName}.
de: Nein, ich habe noch kein Benutzerkonto bei {$journalName}.
es: No, soy nuevo/a en {$journalName}.
fr_ca: Non, je suis un-e nouveau-elle utilisateur-trice de {$journalName}.
hy: Ոչ, ես նոր եմ {$journalName} -ում:
mk_mk: Не, јас сум нов во {$journalName}.
pt: Não, não tenho registo em {$journalName}.
pt_br: Não, sou novo em {$journalName}.
ru_ru: Нет, я впервые регистрируюсь в «{$journalName}».
sl_si: Ne, nisem še registriran pri {$journalName}.
uk: Ні, я новачок у "{$journalName}".

# plugins.generic.openid.step2.help
source: Additional information is required to register to {$journalName}:
cs_cz: K registraci jsou vyžadovány další informace:
da: Yderligere oplysninger er påkrævet for at registrere:
de: Für die Registrierung sind folgende Zusatzinformationen erforderlich:
es: Se requiere información adicional para registrarse:
fr_ca: Des informations additionnelles sont requises afin de vous inscrire dans {$journalName} :
hy: Գրանցվելու համար անհրաժեշտ է լրացուցիչ տեղեկատվություն:
mk_mk: Потребни се дополнителни информации за регистрација:
pt: É necessária informação adicional para o registo:
pt_br: Informações adicionais são necessárias para se registrar:
ru_ru: Для регистрации необходима дополнительная информация:
sl_si: Za registracijo so potrebne dodatne informacije:
uk: Для реєстрації необхідна додаткова інформація:

# plugins.generic.openid.step2.headline
source: Do you already have an account with {$journalName}?
cs_cz: Máte již účet u {$journalName}?
da: Har du allerede en konto hos {$journalName}?
de: Besitzen Sie bereits ein Benutzerkonto bei {$journalName}?
es: ¿Ya tienes una cuenta en {$journalName}?
fr_ca: Avez-vous déjà un compte utilisateur dans {$journalName} ?
hy: Դուք արդեն ունե՞ք հաշիվ {$journalName} -ով:
mk_mk: Дали веќе имате акаунт со {$journalName}?
pt: Já tem um registo em {$journalName}?
pt_br: Você já tem uma conta com {$journalName}?
ru_ru: У Вас уже есть учётная запись в «{$journalName}»?
sl_si: Ali že imate račun pri {$journalName}?
uk: У Вас уже є обліковий запис у "{$journalName}"?

# plugins.generic.openid.step2.title
source: Complete registration
cs_cz: Dokončit registraci
da: Fuldfør registrering
de: Registrierung abschließen
es: Registro completado
hy: Լրիվ գրանցում
mk_mk: Комплетна регистрација
pt: Registo concluído
pt_br: Registro completo
ru_ru: Завершить регистрацию
sl_si: Končaj registracijo
uk: Завершіть реєстрацію

# plugins.generic.openid.description
source: This plugin allows users to register and login with an OpenID providers such as Keycloak.
cs_cz: Tento plugin umožňuje uživatelům registrovat se a přihlásit se u poskytovatelů OpenID, jako je Keycloak.
da: Dette plugin giver brugerne mulighed for at registrere og logge ind med en OpenID-udbyder som f.eks. Keycloak.
de: Dieses Plugin ermöglicht es Benutzern, sich mit einem OpenID-Anbieter wie Keycloak zu registrieren und anzumelden.
es: Este plugin permite a los usuarios/as registrarse e iniciar sesión con un proveedor de OpenID como Keycloak.
fr_ca: Ce plugiciel permet aux utilisateur.trice.s de s'enregistrer et de se connecter avec un fournisseur OpenID tel que Keycloak.
hy: Այս պլագինը թույլ է տալիս օգտվողներին գրանցվել և մուտք գործել OpenID մատակարարներ, ինչպիսին է Keycloak-ը:
mk_mk: Овој плагин овозможува корисниците да се регистрираат и логираат со ОпенИД провајдерите како што е Keycloak.
pt: Este plugin permite aos utilizadores registarem-se e autenticarem-se com fornecedores de Open ID tal com o Keycloak.
pt_br: Este plug-in permite que os usuários se registrem e façam login com provedores de OpenID, como Keycloak.
ru_ru: Этот плагин позволяет пользователям регистрироваться и входить в систему с помощью таких провайдеров OpenID как Keycloak.
sl_si: Vtičnik omogoča, da se uporabniki registrirajo in prijavijo preko OpenID ponudnikov kot je Keycloak.
uk: Цей плагін дає змогу користувачам реєструватися та входити за допомогою постачальників OpenID, таких як Keycloak.

# plugins.generic.openid.name
source: OpenID Authentication Plugin
cs_cz: Plugin ověření OpenID
da: OpenID-godkendelsesplugin
de: OpenID Authentifizierungs-Plug-In
es: Módulo de autenticación OpenID
fr_ca: Plugiciel d'authentification OpenID
hy: OpenID վավերացման պլագին
mk_mk: Плагин за автентификација на ОпенИД
pt: Plugin de Autenticação OpenID
pt_br: Plug-in de autenticação OpenID
ru_ru: Плагин «Авторизация OpenID»
sl_si: Vtičnik za OpenID avtentikacijo
uk: Плагін автентифікації OpenID

# plugins.generic.openid.form.error.emailExists
source: The email address you provided already exists. Please try to log in to the existing account.
cs_cz: Zadaná e-mailová adresa již existuje. Zkuste se přihlásit k existujícímu účtu.
da: Den e-mail-adresse, du har angivet, findes allerede. Prøv at logge ind på den eksisterende konto.
de: Die verwendete E-Mail-Adresse existiert bereits. Bitte versuchen Sie, sich bei dem bereits vorhandenen Konto anzumelden.
es: La dirección de correo electrónico proporcionada ya existe. Por favor, intente acceder con una cuenta existente.
fr_ca: L'adresse courriel fournie existe déjà.
hy: Ձեր տրամադրած էլ. փոստի հասցեն արդեն գոյություն ունի: Խնդրում ենք փորձել մուտք գործել գոյություն ունեցող հաշիվ:
mk_mk: Имејл адресата што ја дадовте веќе постои. Молам логирајте се со псотоечкиот акаунт.
pt: O endereço de e-mail que inseriu já existe. Entre na sua conta.
pt_br: O endereço de e-mail fornecido já existe. Por favor, tente fazer login na conta existente.
ru_ru: Адрес электронной почты, указанный Вами, уже существует. Пожалуйста, попробуйте войти в систему с существующей учётной записью.
sl_si: Email naslov že obstaja. Prosimo poskusite se prijaviti v obstoječi račun.
uk: Указана Вами адреса електронної пошти вже існує. Будь ласка, спробуйте увійти в обліковий запис, що існує.

# plugins.generic.openid.settings.google.desc
source: You have to to create an OpenID Connect client in the <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a> to use Google as an OpenID Connect provider. See this <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>tutorial</a>. Please use this redirect URL:
cs_cz: Musíte si vytvořit klienta OpenID Connect v <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'> Google Developer Console </a> pokud chcete používat Google jako poskytovatele OpenID Connect. Přečtěte si tento <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'> tutorial</a>. Použijte, prosím, tuto adresu URL přesměrování:
da: Du skal oprette en OpenID Connect-klient i <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a> for at bruge Google som en OpenID Connect-udbyder. Se denne <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>vejledning</a>. Brug denne redirect-URL:
de: Sie müssen einen OpenID Connect-Client in der <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a> anlegen, um Google als OpenID Connect-Anbieter zu verwenden. Siehe hierzu dieses <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>Tutorial</a>. Bitte verwenden Sie diese Redirect-URL:
es: Debe crear un cliente OpenID Connect en la <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a> para usar Google como proveedor de OpenID Connect. Consulte este <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>tutorial</a>. Utilice esta URL de redireccionamiento:
hy: Դուք պետք է ստեղծեք OpenID Connect հաճախորդ այստեղ <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a>Google-ը որպես OpenID Connect մատակարար օգտագործելու համար: Տես սա <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>ձեռնարկ</a>. Խնդրում ենք օգտագործել վերահղման այս URL-ը:
mk_mk: Мора да создадете клиент за поврзување со ОпенИД во <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer конзолата</a> за да го користите Google како провајдер за поврзување до ОпенИД. Погледнете го следното <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>упатство</a>. Ве молиме да го употребите следното УРЛ за пренасочување:
pt: É necessário criar um cliente OpenID Connect client em <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a> para usar o Google como um Conector forneceder de OpenID. Ver este <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>tutorial</a>. Use este URL de redirecionamento:
pt_br: Você deve criar um cliente OpenID Connect no <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console </a> para usar o Google como um provedor OpenID Connect. Veja este <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'> tutorial </a>. Use esta URL de redirecionamento:
ru_ru: Вам необходимо создать клиента OpenID Connect в <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a> , чтобы использовать Google как провайдера OpenID Connect. Подробности — в этом <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>руководстве</a>. Пожалуйста, используйте этот URL перенаправления:
sl_si: Za uporabo Googla kot OpenID ponudnika morate kreirati OpenID Connect klienta v <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a>. Poglejte ta <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>navodila</a>. Prosimo uporabite ta URL:
uk: Вам потрібно створити клієнт OpenID Connect у <a href='https://console.developers.google.com/apis/credentials' target='_blank' rel='noopener'>Google Developer Console</a>, щоб використовувати Google як постачальника OpenID Connect. Див. цей <a href='https://developers.google.com/identity/protocols/oauth2/openid-connect' target='_blank' rel='noopener'>підручник.</a> Будь ласка, використовуйте цю URL-адресу перенаправлення:
