Repository: pkp/openid
Catalog: locale/*/locale.po
Languages: cs_cz, da, de, es, fr_ca, hy, mk_mk, pt, pt_br, ru_ru, sl_si, uk

# plugins.generic.openid.settings.generateAPIKey.desc
source: This plugin can generate a key by encrypting the OpenID identifier with <strong>the secret entered above</strong>. This key will be encrypted again with a secret that must be specified in the application settings. This should be adequately secure.
cs_cz: Tento plugin může generovat klíč šifrováním identifikátoru OpenID pomocí <strong> výše zadaného tajného klíče</strong>. Tento klíč bude znovu zašifrován tajným klíčem, který musí být zadán v nastavení aplikace. Toto opatření by mělo poskytovat přiměřené zabezpečení.
da: Dette plugin kan generere en nøgle ved at kryptere OpenID-identifikatoren med <strong>den hemmelige nøgle indtastet ovenfor</strong>. Denne nøgle krypteres igen med en hemmelig nøgle, der skal specificeres i applikationsindstillingerne. Dette bør være en tilstrækkelig sikkerhed.
de: Dieses Plugin kann einen Schlüssel erzeugen, indem es den OpenID-Bezeichner mit dem <strong>oben eingegebenen Secret verschlüsselt</strong>. Dieser Schlüssel wird wiederum mit einem Secret verschlüsselt, das in den App-Einstellungen angegeben werden muss, welches hinreichend sicher sein sollte.
es: Este módulo puede generar una clave mediante la encriptación del identificador OpenID con <strong>la contraseña secreta introducida anteriormente</strong>. Esta clave se encriptará de nuevo con una contraseña secreta que deberá especificarse en los ajustes de la aplicación. Esto debería ser suficientemente seguro.
hy: Այս փլագինը կարող է բանալի ստեղծել՝ գաղտնագրելով OpenID նույնացուցիչը <strong>վերևում մուտքագրված գաղտնիքով</strong>: Այս բանալին նորից կգաղտնագրվի գաղտնիքով, որը պետք է նշվի հավելվածի կարգավորումներում: Սա պետք է լինի բավականաչափ ապահով:
mk_mk: Овој плагин создава клуч со енкриптирање на ОпенИД идентификаторот со <strong>тајната внесена погоре</strong>. Овој клуч ќе биде повторно енкриптиран со тајна која мора да биде специфицирана подесувањата од апликацијата. Ова треба да биде соодветно сигурно.
pt: Este plugin gera uma kwy ao encriptar um identificador OpenID com <strong>o segredo inserido abaixo</strong>. Esta key será encriptada de novo com um segredo que deve ser especificado nas configurações da aplicação. Isto deve ser adequadamente seguro.
pt_br: Este plugin pode gerar uma chave criptografando o identificador OpenID com <strong> o segredo inserido acima </strong>. Essa chave será criptografada novamente com um segredo que deve ser especificado nas configurações do aplicativo. Isso deve ser adequadamente seguro.
ru_ru: Этот плагин может генерировать ключ путем шифрования идентификатора OpenID с помощью <strong>секретного ключа, указанного выше</strong>. Этот ключ будет снова зашифрован с помощью секретного ключа, который должен быть указан в настройках приложения. Это должно быть достаточно безопасно.
sl_si: Vtičnik lahko generira ključ s pomočjo enkripcije OpenID identifikatorja s pomočjo <strong>secret vnešenega zgoraj</strong>. Ta ključ bo ponovno enkriptiran s secret, ki mora biti vnesen v nastavitvah aplikacije. To bi moralo biti dovolj varno.
uk: Цей плагін може генерувати ключ, шифруючи ідентифікатор OpenID <strong>секретом, введеним вище</strong>. Цей ключ буде знову зашифрований секретом, який необхідно вказати в налаштуваннях програми. Це має бути належним чином безпечно.

# plugins.generic.openid.error.openid.connect.desc.data
source: <strong>An error occurred while receiving your data from the OpenId provider.</strong><br />The service may not be available right now.<br />Please try again later and <a href='mailto:{$supportEmail}'>contact technical support</a> if the problem still exists.
cs_cz: <strong>Při načítání vašich údajů od poskytovatele OpenID došlo k chybě.</strong><br />Služba nemusí být momentálně k dispozici. <br /> Zkuste to znovu později a <a href = 'mailto: {$ supportEmail} '>> kontaktujte technickou podporu </a>, pokud problém přetrvává.
da: <strong>Der opstod en fejl under modtagelse af dine data fra OpenId-udbyderen.</strong><br />Tjenesten er muligvis ikke tilgængelig lige nu.<br />Prøv igen senere og <a href = 'mailto: {$supportEmail} '>kontakt teknisk support</a>, hvis problemet fortsætter.
de: <strong>Beim Empfang Ihrer Daten vom OpenId-Anbieter ist ein Fehler aufgetreten.</strong><br />Der Dienst ist möglicherweise im Moment nicht verfügbar.<br />Bitte versuchen Sie es später noch einmal und kontaktieren Sie den <a href='mailto:{$supportEmail}'>Technischen Support</a>, wenn das Problem weiterhin besteht.
es: <strong>Se produjo un error mientras se recibían sus datos desde el proveedor OpenID.</strong><br />Puede que el servicio no esté disponible en estos momentos.<br />Inténtelo de nuevo más tarde y <a href='mailto:{$supportEmail}'>contacte con el soporte técnico</a> si el problema persiste.
hy: <strong>Սխալ է տեղի ունեցել OpenId-ի մատակարարից ձեր տվյալները ստանալու ժամանակ:</strong><br />Ծառայությունը կարող է հասանելի չլինել հենց հիմա:<br />Խնդրում ենք փորձել ավելի ուշ և <a href='mailto:{$ supportEmail}'>դիմեք տեխնիկական աջակցությանը</a>, եթե խնդիրը դեռ գոյություն ունի:
mk_mk: <strong>Настана грешка при приемот на вашите податоци од ОпенИД провајдерот.</strong><br />Услугата можеби не е достапна во моментов.<br />Обидете се подоцна и <a href='mailto:{$supportEmail}'>контактирајте ја техничката поддршка</a> доколку проблемот се уште постои.
pt: <strong>Ocorreu um erro enquanto recebíamos os seus dados do fornecedor OpenID.</strong><br />O serviço pode estar indisponível de momento.<br />Tente novamente mais tarde e <a href='mailto:{$supportEmail}'>contacte o apoio técnico</a> se o problema persistir.
pt_br: <strong> Ocorreu um erro ao receber seus dados do provedor OpenId. </strong> <br /> O serviço pode não estar disponível no momento. <br /> Tente novamente mais tarde e <a href='mailto:{$supportEmail}'> entre em contato com o suporte técnico </a> se o problema persistir.
ru_ru: <strong>Произошла ошибка при получении Ваших данных от провайдера OpenId.</strong><br />Служба может быть недоступна в данный момент.<br />Пожалуйста, попробуйте ещё раз позже и <a href='mailto:{$supportEmail}'>свяжитесь с технической поддержкой</a>, если проблема по-прежнему сохраняется.
sl_si: <strong>Prišlo je do napake pri prejemanju vaših podatkov iz OpenID ponudnika.</strong><br />Morda storitev ta trenutek ni na voljo.<br />Prosimo, poskusite kasneje in če se bo težava ponavljala <a href='mailto:{$supportEmail}'>o tem obvestite tehnično podporo</a>.
uk: <strong>Під час отримання даних від постачальника OpenID сталася помилка.</strong><br />Послуга може бути недоступна прямо зараз.<br />Повторіть спробу пізніше та <a href='mailto:{$supportEmail}'>зверніться до служби технічної підтримки</a> ,якщо проблема все ще існує.

# plugins.generic.openid.error.openid.cert.desc
source: <strong>An error occurred while validation and extracting your data.</strong><br />The service may not be available right now.<br />Please try again later and <a href='mailto:{$supportEmail}'>contact technical support</a> if the problem still exists.
cs_cz: <strong>Při ověřování a získávání vašich dat došlo k chybě.</strong><br />Služba nemusí být právě teď k dispozici. <br /> Zkuste to znovu později a <a href = 'mailto: {$ supportEmail} '> Pokud problém přetrvává, kontaktujte technickou podporu </a>.
da: <strong>Der opstod en fejl under validering og udpakning af dine data.</strong><br />Tjenesten er muligvis ikke tilgængelig lige nu.<br />Prøv igen senere og <a href = 'mailto: {$supportEmail} '>kontakt teknisk support</a>, hvis problemet fortsætter.
de: <strong>Bei der Überprüfung und dem Auslesen Ihrer Daten ist ein Fehler aufgetreten.</strong><br />Der Dienst ist möglicherweise im Moment nicht verfügbar.<br />Bitte versuchen Sie es später noch einmal und kontaktieren Sie den <a href='mailto:{$supportEmail}'>Technischen Support</a>, wenn das Problem weiterhin besteht.
es: <strong>Se produjo un error mientras se validaban y extraían sus datos.</strong><br />Puede que el servicio no esté disponible en estos momentos.<br />Inténtelo de nuevo más tarde y <a href='mailto:{$supportEmail}'>contacte con el soporte técnico</a> si el problema persiste.
hy: <strong>Սխալ է տեղի ունեցել ձեր տվյալների վավերացման և հանելու ժամանակ:</strong><br />Ծառայությունը կարող է հասանելի չլինել հենց հիմա:<br />Խնդրում ենք փորձել ավելի ուշ և <a href='mailto:{$supportEmail} '>դիմեք տեխնիկական աջակցությանը</a>, եթե խնդիրը դեռ առկա է:
mk_mk: <strong>Настана грешка при проверка и отпакување на вашите податоци.</strong><br />Услугата можеби не е достапна во моментов.<br />Обидете се подоцна и <a href='mailto:{$supportEmail}'>контактирајте ја техничката поддршка</a> доколку проблемот се уште постои.
pt: <strong>Ocorreu um erro durante a validação e extração dos seus dados.</strong><br />O serviço pode estar indisponível de momento.<br />Tente novamente mais tarde e <a href='mailto:{$supportEmail}'>contacte o apoio técnico</a> se o problema persistir.
pt_br: <strong> Ocorreu um erro ao validar e extrair seus dados. </strong> <br /> O serviço pode não estar disponível no momento. <br /> Tente novamente mais tarde e<a href='mailto:{$supportEmail}'> entre em contato com o suporte técnico </a> se o problema persistir.
ru_ru: <strong>Произошла ошибка при проверке и извлечении Ваших данных.</strong><br />Служба может быть недоступна в данный момент.<br />Пожалуйста, попробуйте ещё раз позже и <a href='mailto:{$supportEmail}'>свяжитесь с технической поддержкой</a>, если проблема по-прежнему сохраняется.
sl_si: <strong>Prišlo je do napake pri preverjanju in razčlenitvi vaših podatkov.</strong><br />Morda storitev ta trenutek ni na voljo.<br />Prosimo, poskusite kasneje in če se bo težava ponavljala <a href='mailto:{$supportEmail}'>o tem obvestite tehnično podporo</a>.
uk: <strong>Під час перевірки та видобування даних сталася помилка.</strong><br />Послуга може бути недоступна прямо зараз.<br />Повторіть спробу пізніше та <a href='mailto:{$supportEmail}'>зверніться до служби технічної підтримки</a>, якщо проблема все ще існує.

# plugins.generic.openid.disables.fields.info
source: Some information is provided by an authenticated account used to login and cannot be edited.<br /> The data will be synced whenever you log out and login again.
cs_cz: Některé informace poskytuje ověřený účet používaný k přihlášení a nelze je upravovat.<br />Data budou synchronizována, kdykoli se odhlásíte a znovu se přihlásíte.
da: Nogle oplysninger leveres af en godkendt konto, der bruges til login og kan ikke redigeres.<br />Dataene synkroniseres, hver gang du logger ud og logger ind igen.
de: Einige Informationen werden von einem zur Anmeldung verwendeten authentifizierten Account bereitgestellt und können nicht bearbeitet werden. <br /> Die Daten werden synchronisiert, sobald Sie sich ab- und wieder anmelden.
es: Hay información que no puede editarse porque fue proporcionada por una cuenta autenticada que se usó para iniciar la sesión.<br />Los datos se sincronizarán cada vez que cierre la sesión y vuelva a iniciarla.
hy: Որոշ տեղեկություններ տրամադրվում են վավերացված հաշվի կողմից, որն օգտագործվում է մուտք գործելու համար և չի կարող խմբագրվել:<br /> Տվյալները կհամաժամացվեն, երբ դուրս գաք և նորից մուտք գործեք:
mk_mk: Некои од информациите се обезбедени преку проверен акаунт искористен за најава и не можат да се менуваат. <br /> Податоците ќе се синхронизираат кога ќе се одјавите и повторно најавите.
pt: Alguma informação foi fornecida por uma conta autenticada e não pode ser editada.<br />Os dados serão sincronizados sempre que entrar ou sair.
pt_br: Algumas informações são fornecidas por uma conta autenticada usada para fazer o login e não podem ser editadas. <br /> Os dados serão sincronizados sempre que você fizer logout e login novamente.
ru_ru: Часть информации, предоставленной авторизованной учётной записью, используется для входа в систему и не может быть отредактирована.<br /> Данные будут синхронизироваться каждый раз, когда Вы выходите из системы и снова входите в неё.
sl_si: Določene informacije pridejo preko uporabljenega avtenticiranega računa za prijavo in ne morejo biti spremenjene.<br /> Podatki se bodo sinhronizirani vsakič, ko se odjavite in spet prijavite.
uk: Деяка інформація надається автентифікованим обліковим записом, який використовується для входу, і не може бути відредагована.<br /> Дані синхронізуватимуться щоразу, коли ви виходите із системи та знову входите в систему.

# plugins.generic.openid.step2.connect.siteNameMissing
source: Please login to your account.<br />Your information will be updated automatically.
da: Vær venlig at logge ind på din konto.<br />Din information vil automatisk blive opdateret.
de: Bitte loggen Sie sich bei Ihrem Account ein.<br />Ihre Informationen werden automatisch aktualisiert.
es: Inicie sesión en su cuenta.<br />Su información se actualizará automáticamente.
hy: Խնդրում ենք մուտք գործել ձեր հաշիվ:<br />Ձեր տեղեկությունները ինքնաշխատ կերպով կթարմացվեն:
pt: Faça login na sua conta.<br />As suas informações serão atualizadas automaticamente.
pt_br: Faça login em sua conta.<br />Suas informações serão atualizadas automaticamente.
uk: Будь ласка, увійдіть до свого облікового запису.<br />Вашу інформацію буде оновлено автоматично.

# plugins.generic.openid.form.error.privacyConsent.required
source: You must agree to the terms of the privacy statement.
cs_cz: Musíte souhlasit s podmínkami prohlášení o ochraně osobních údajů.
da: Du skal acceptere vilkårene i forbindelse med erklæring om beskyttelse af personlige oplysninger.
de: Die Zustimmung zu den Datenschutzbestimmungen ist zwingend erforderlich.
es: Debe aceptar los términos de la declaración de privacidad.
fr_ca: Vous devez approuver la déclaration de confidentialité.
hy: Դուք պետք է համաձայնեք գաղտնիության հայտարարության պայմաններին:
mk_mk: Мора да се согласите со поимите од приватната изјава.
pt: Deve concordar com os termos da política de privacidade.
pt_br: Você deve concordar com os termos da declaração de privacidade.
ru_ru: Вы должны согласиться с Условиями конфиденциальности.
sl_si: Strinjati se morate z izjavo o zasebnosti.
uk: Ви повинні прийняти умови заяви про конфіденційність.

# plugins.generic.openid.form.error.invalid.credentials
source: The password is incorrect.
cs_cz: Heslo je nesprávné.
da: Password er forkert.
de: Falsches Passwort.
es: La contraseña es incorrecta.
fr_ca: Le mot de passe est incorrect.
hy: Գաղտնաբառը սխալ է:
mk_mk: Лозинката не е коректна.
pt: A senha está incorreta.
pt_br: A senha está incorreta.
ru_ru: Неправильный пароль.
sl_si: Geslo je napačno.
uk: Пароль неправильний.

# plugins.generic.openid.settings.error
source: <strong>Incorrect OpenID plugin configuration!</strong><br />There is no OpenID Provider configured!<br />Please report this to your technical support.
cs_cz: <strong> Nesprávná konfigurace pluginu OpenID! </strong><br /> Není nakonfigurován žádný poskytovatel OpenID!<br />Nahlaste, prosím, tento problém technické podpoře.
da: <strong>Forkert OpenID-plugin-konfiguration!</strong> <br />Der er ikke konfigureret en OpenID-udbyder!<br /> Rapportér dette til din tekniske support.
de: <strong>Falsche OpenID-Plugin-Konfiguration!</strong><br Es wurde kein OpenID-Provider konfiguriert!<br />Bitte melden Sie das Ihrem technischen Support.
es: <strong>Los ajustes del módulo OpenID son incorrectos.</strong><br />No hay ningún proveedor OpenID configurado.<br />Informe de este error a su soporte técnico.
hy: <strong>Սխալ OpenID հավելվածի կազմաձևում:</strong><br />Կազմաձևված չէ OpenID-ի մատակարարը:<br />Խնդրում ենք հայտնել այս մասին ձեր տեխնիկական աջակցությանը:
mk_mk: <strong>Неточна конфигурација на ОпенИД!</strong><br />Нема кофигуриран ОпенИД провајдер!<br />Ве молиме да го известите вашиот тим за техничка поддршка.
pt: <strong>Configuração do plugin de OpenID incorreta!</strong><br />Não foi configurado um forneceder de OpenID!<br />Reporte esta situação ao apoio técnico.
pt_br: <strong> Configuração incorreta do plugin OpenID! </strong> <br /> Não há nenhum provedor OpenID configurado! <br /> Por favor, informe ao seu suporte técnico.
ru_ru: <strong>Неправильная конфигурация плагина OpenID!</strong><br />Нет настроенного провайдера OpenID!<br />Пожалуйста, сообщите об этом своей технической поддержке.
sl_si: <strong>Napačna nastavitev OpenID vtičnika!</strong><br />OpenID ponudnik ni nastavljen<br />Prosimo sporočite to vaši tehnični podpori.
uk: <strong>Неправильна конфігурація плагіна OpenID!</strong><br />Постачальника OpenID не налаштовано!<br />Будь ласка, повідомте про це свою технічну підтримку.

# plugins.generic.openid.settings.openid.desc
source: Please enter the following information according to your OpenID provider.
cs_cz: Zadejte prosím následující informace podle svého poskytovatele OpenID.
da: Indtast følgende oplysninger fra din OpenID-udbyder.
de: Bitte geben Sie die folgenden Informationen entsprechend Ihrem OpenID-Anbieter ein.
es: Introduzca la siguiente información de acuerdo con su proveedor OpenID.
hy: Խնդրում ենք մուտքագրել հետևյալ տվյալները ըստ ձեր OpenID մատակարարի:
mk_mk: Ве молиме да ги внесете следните информации согласно со вашиот ОпенИД провајдер.
pt: Insira a seguinte informação de acordo com o seu fornecedor OpenID.
pt_br: Insira as seguintes informações de acordo com seu provedor de OpenID.
ru_ru: Пожалуйста, введите следующую информацию в соответствии с данными вашего провайдера OpenID.
sl_si: Prosimo vnesite naslednje informacije kot jih zahteva vaš OpenID ponudnik.
uk: Будь ласка, введіть таку інформацію відповідно до вимог Вашого постачальника OpenID.

# plugins.generic.openid.settings.custom.desc
source: If you want to use a custom OpenID Connect Provider (e.g. a self-hosted Keycloak server), you have to provide the URL to the OpenID configuration endpoint and the client credentials.
cs_cz: Pokud chcete použít vlastního poskytovatele OpenID Connect (např. vlastní server Keycloak), musíte zadat adresu URL koncového bodu konfigurace OpenID a přihlašovací údaje klienta.
da: Hvis du vil bruge en brugerdefineret OpenID Connect-udbyder (f.eks. en selvhostet Keycloak-server), skal du angive URL'en til OpenID-konfigurationsendepunktet og klientens legitimationsoplysninger.
de: Wenn Sie einen benutzerdefinierten OpenID-Connect-Provider verwenden möchten (z. B. einen selbst gehosteten Keycloak-Server), müssen Sie die URL zum OpenID-Konfigurationsendpunkt und die Client-Anmeldeinformationen angeben.
es: Si desea utilizar un proveedor de conexión OpenID personalizado (p. ej.: un servidor Keycloak autoalojado), deberá proporcionar la URL a los ajustes del terminal OpenID y las credenciales del cliente.
hy: Եթե ցանկանում եք օգտագործել սովորական OpenID Connect-ի մատակարար (օրինակ՝ ինքնակառավարվող Keycloak սերվեր), դուք պետք է URL տրամադրեք OpenID-ի կազմաձևման վերջնակետին և հաճախորդի հավատարմագրերին:
mk_mk: Доколку сакате да користите сопствен провајдер за конекција до ОпенИД (на пр. сопствен Keycloak сервер), мора да доставите УРЛ до крајната точка на кофигурацијата на ОпенИД и акредитивите на клиентот.
pt: Se deseja utilizar um Fornecedor de Conectores OpenID personalizados (ex. um servidor auto-alojado Keycloak), deve inserir o URL para o endpoint de configuração do OpenID e as credenciais de cliente.
pt_br: Se você deseja usar um provedor OpenID Connect personalizado (por exemplo, um servidor Keycloak auto-hospedado), é necessário fornecer a URL para o endpoint de configuração OpenID e as credenciais do cliente.
ru_ru: Если вы хотите использовать пользовательский провайдер соединения с OpenID (например, серевер Keycloak на собственном хостинге), вы должны указать URL к конечной точке конфигурации OpenID и данные клиента для авторизации.
sl_si: Če želite uporabljati OpenID ponudnika po meri (npr. lasten Keycloak strežnik), morate zagotoviti URL do OpenID konfiguracijske točka in poverilnice klienta.
uk: Якщо ви хочете використовувати настроюваного постачальника OpenID Connect (наприклад, сервер Keycloak із власним хостингом), вам потрібно надати URL-адресу кінцевої точки конфігурації OpenID та облікові дані клієнта.

# plugins.generic.openid.settings.btnImg.desc
source: Please enter a URL to an image (46x41) to be displayed on the login button. If no image is provided, the OpenID logo will be shown.
cs_cz: Zadejte adresu URL obrázku (46x41), který se zobrazí na přihlašovacím tlačítku. Pokud není uveden žádný obrázek, zobrazí se logo OpenID.
da: Indtast en URL til et billede (46x41), der skal vises på login-knappen. Hvis der ikke er noget billede, vises OpenID-logoet.
de: Bitte geben Sie eine URL zu einem Bild (46x41) an, das auf der Login-Schaltfläche angezeigt werden soll. Wenn Sie kein Bild angeben möchten, wird das OpenID-Logo angezeigt.
es: Introduzca una URL a la imagen (46x41) que debe mostrarse en el botón de inicio de sesión. Si no se proporciona ninguna imagen, se mostrará el logotipo de OpenID.
hy: Խնդրում ենք մուտքագրել պատկերի URL (46x41), որը կցուցադրվի մուտքի կոճակի վրա: Եթե պատկեր չտրամադրվի, կցուցադրվի OpenID պատկերանշանը:
mk_mk: Ве молиме да внесете УРЛ до слика (46x41) која ќе биде прикажана на копчето за пријавување. Доколку не е доставен слика, ќе биде прикажано логото на ОпенИД.
pt: Insira um URL para uma imagem (46x41) para ser disponibilizada no botão de acesso. Se não for inserida qualquer imagem, aparecerá o logo do OpenID.
pt_br: Insira uma URL para uma imagem (46x41) a ser exibida no botão de login. Se nenhuma imagem for fornecida, o logotipo OpenID será mostrado.
ru_ru: Пожалуйста, введите URL к изображению (46x41), которое должно отображаться на кнопке входа. Если изображение не будет указано, на кнопке будет показан логотип OpenID.
sl_si: Prosimo vnesite URL do slike (46x41), ki bo prikazana na gumbu za prijavo. Če ne posredujete slike, bo prikazan OpenID logo.
uk: Будь ласка, введіть URL-адресу зображення (46x41), яке буде відображатися на кнопці входу. Якщо зображення не надано, буде показано логотип OpenID.
