Repository: pkp/openid
Catalog: locale/*/locale.po
Languages: cs_cz, da, de, es, fr_ca, hy, mk_mk, pt, pt_br, ru_ru, sl_si, uk

# plugins.generic.openid.settings.microsoft.desc
source: You have to to configure your App Service in the <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>Azure portal</a> (go to 'App registrations' after login) to use Azure AD login. See this <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>tutorial</a>. Please use this redirect URL:
cs_cz: Musíte nakonfigurovat svou App Service na <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'> portálu Azure </a> (po přihlášení přejděte na 'Registrace aplikací - App registrations' ) a použijte přihlášení Azure AD. Viz tento <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'> tutorial </a>. Použijte prosím tuto adresu URL přesměrování:
da: Du skal konfigurere din App-tjeneste i <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>Azure portalen</a> (gå til 'App registrations' efter login) for at bruge Azure AD login. Se denne <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>vejledning</a>. Brug denne redirect-URL:
de: Konfigurieren Sie Ihren App Service im <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>Azure portal</a>(go to 'App registrations' after login), um den Azure AD login zu nutzen. Siehe hierzu dieses <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>Tutorial</a>. Bitte verwenden Sie diese Redirect-URL:
es: Debe configurar su aplicación de servicio (App Service) en el <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>portal Azure</a> (tras iniciar sesión vaya a 'App registrations') para usar el inicio de sesión Azure AD. Consulte este <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>tutorial</a>. Use esta URL de redireccionamiento:
hy: Դուք պետք է կարգավորեք ձեր App Service-ը այստեղ <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>Azure portal</a> (գնա 'Հավելվածների գրանցումներ' մուտք գործելուց հետո) որպեսզի օգտագործես Azure AD մուտքը: Տես սա <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>ձեռնարկ</a>. Խնդրում ենք օգտագործել վերահղման այս URL-ը:
mk_mk: Мора да ги конфигурирате услугите на вашата апликација преку <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>Azure порталот</a> (одете во 'регистрација на апликација' после најавата) за да го користите Azure AD најавувањето. Погледнете го следното <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>упатство</a>. Ве молиме да го употребите следното УРЛ за пренасочување:
pt: É necessário configurar a sua App Service no <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>portal Azure</a> (vá a 'registo de App' depois de entrar) para usar o acesso Azure AD. Veja este <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>tutorial</a>. Use este URL de redirecionamento:
pt_br: Você deve configurar seu Serviço de Aplicativo no <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'> Portal do Azure </a > (vá para 'Registros de aplicativos' após o login) para usar o login do Azure AD. Veja este <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'> tutorial </a >. Use esta URL de redirecionamento:
ru_ru: Вам необходимо настроить вашу Службу приложений в <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>портале Azure</a> (перейдите в «Регистрация приложений» после входа), чтобы использовать вход через Azure AD. Подробности — в этом <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>руководстве</a>. Пожалуйста, используйте этот URL перенаправления:
sl_si: Za uporabo Azure AD prijave morate skonfigurirati App service v <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>Azure portalu</a> (po prijavi pojdite na 'App registrations'). Več v <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>navodilih</a>. Prosimo uporabite ta URL:
uk: Ви повинні налаштувати свою службу програм на <a href='https://portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Overview' target='_blank' rel='noopener'>порталі Azure</a> (перейдіть до "App registrations" після входу), щоб використовувати логін Azure AD. Перегляньте цей <a href='https://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad' target='_blank' rel='noopener'>підручник</a>. Будь ласка, використовуйте цю URL-адресу перенаправлення:

# plugins.generic.openid.settings.configUrl
source: OpenID Provider URL
cs_cz: URL poskytovatele OpenID
da: OpenID-udbyders URL
es: URL del proveedor OpenID
hy: OpenID մատակարարի URL
mk_mk: УРЛ на ОпенИД провајдер
pt: URL de fornecedor OpenID
pt_br: URL do provedor OpenID
ru_ru: URL провайдера OpenID
sl_si: URL OpenID ponudnika
uk: URL-адреса постачальника OpenID

# plugins.generic.openid.settings.legacyRegister.desc
source: Enable this option if you want users to be able to register with the application's register form in addition to the OpenID logon.
da: Aktivér denne mulighed, hvis du vil have, at brugerne skal kunne registrere sig med applikationens registreringsformular ud over OpenID-login.
es: Active esta opción si quiere que los usuarios/as puedan registrarse con el formulario de registro de la aplicación además de con el inicio de sesión de OpenID.
hy: Միացրեք այս տարբերակը, եթե ցանկանում եք, որ օգտատերերը բացի OpenID մուտքից, կարողանան գրանցվել հավելվածի գրանցաձևով:
pt: Ative esta opção se desejar que os utilizadores possam registrar-se no formulário de registo da aplicação, além do login do OpenID.
pt_br: Habilite esta opção se desejar que os usuários possam se registrar no formulário de registro do aplicativo, além do logon do OpenID.
uk: Увімкніть цей параметр, якщо ви хочете, щоб користувачі могли реєструватися за допомогою реєстраційної форми програми на додаток до входу OpenID.

# plugins.generic.openid.settings.step2.connect
source: Account Connection
cs_cz: Připojení k účtu
da: Kontoforbindelse
de: Account-Verknüpfung
es: Conexión de la cuenta
hy: Հաշիվների միացում
mk_mk: Поврзување на акаунти
pt: Conexão de Conta
pt_br: Conexão de conta
ru_ru: Соединение учётных записей
sl_si: Povezava računa
uk: Зв'язок облікового запису

# plugins.generic.openid.settings.features.enable.provider.sync.desc
source: Some user information, such as the given name, family name and email address, is transferred from the OpenID Provider to this application. Enable this option to automatically save this user information to the user account. (recommended)
cs_cz: Některé informace o uživateli, jako je křestní jméno, příjmení a e-mailová adresa, se přenášejí od poskytovatele OpenID do této aplikace. Povolením této možnosti automaticky uložíte informace o tomto uživateli do uživatelského účtu. (doporučeno)
da: Visse brugeroplysninger, såsom for navn, familienavn og e-mail-adresse, overføres fra OpenID-udbyderen til denne applikation. Aktivér denne indstilling for automatisk at gemme denne brugerinformation på brugerkontoen. (anbefales)
de: Einige Benutzerinformationen, wie z. B. der Vor- und Nachname und die E-Mail-Adresse, werden vom OpenID-Provider an diese App weitergegeben. Aktivieren Sie diese Option, um diese Benutzerinformationen automatisch im Benutzerkonto zu speichern.
es: Cierta información del usuario/a, como el nombre, los apellidos y la dirección de correo electrónico, se transfiere del proveedor OpenID a esta aplicación. Active esta opción para guardar automáticamente esta información del usuario/a en su cuenta. (recomendado)
hy: Օգտատիրոջ որոշ տեղեկություններ, ինչպիսիք են անունը, ազգանունը և էլ․ հասցեն, փոխանցվում են OpenID Մատակարարից այս հավելվածին: Միացրեք այս տարբերակը՝ օգտվողի այս տեղեկությունները օգտատիրոջ հաշվում ինքնաշխատ կերպով պահպանելու համար: (խորհուրդ է տրվում)
mk_mk: Некои кориснички информации, како името, презимето и е-поштата се пренесени од ОпенИД провајдерот на оваа апликација. Овозможете ја оваа опција за автоматски да ги зачувате корисничките информации на корисничкиот профил. (препорачано)
pt: Alguma informação do utilizador, tal como nome próprio, apelido e endereço de e-mail, é transferido do fornecedor OpenID para esta aplicação. Ative esta opção para guardar automaticamente esta informação de utilizador para a conta de utilizador. (recomendado)
pt_br: Algumas informações do usuário, como o nome fornecido, o sobrenome e o endereço de e-mail, são transferidas do provedor OpenID para este aplicativo. Habilite esta opção para salvar automaticamente essas informações do usuário na conta do usuário. (recomendado)
ru_ru: Некоторая информация о пользователе, такая как имя, фамилия и адрес электронной почты, передаётся от провайдера OpenID этому приложению. Включите этот параметр, чтобы автоматически сохранять эту информацию о пользователе в его учётной записи. (рекомендуется)
sl_si: Določene informacije, kot so ime, priimek in email, so prenešene od OpenID ponudnika do te aplikacije. Omogoči to opcijo za avtomatično shranjevanje teh informacij v uporabniškem računu. (priporočljivo)
uk: Деякі відомості про користувача, такі як ім'я, прізвище й адреса електронної пошти, передаються від постачальника OpenID до цієї програми. Увімкніть цей параметр, щоб автоматично зберігати ці відомості користувача в обліковому записі користувача. (рекомендується)

# plugins.generic.openid.settings.step2.connect.check
source: Disable "Account Connection"
cs_cz: Zakázat "Připojení k účtu"
da: Deaktiver "Kontoforbindelse"
de: "Account Connection" deaktivieren
es: Desactivar la "conexión de la cuenta"
hy: Անջատել «Հաշվի միացումը»
mk_mk: Оневозможи „поврзување на акаунти“
pt: Desativar "Conexão de Conta"
pt_br: Desativar "Conexão de conta"
ru_ru: Отключить «Соединение учётных записей»
sl_si: Onemogoči "Povezavo računa"
uk: Відключити "Зв'язок облікового запису"

# plugins.generic.openid.settings.features.disable.given
source: <strong>Given name</strong> readonly
cs_cz: <strong>Křestní jméno</strong> pouze pro čtení
da: <strong>Fornavn</strong> readonly
de: <strong>Vorname schreibgeschützt</strong>
es: <strong>Nombre</strong> solo de lectura
hy: <strong>Անուն</strong> միայն կարդալ
mk_mk: <strong>Лично име</strong> само за читање
pt: <strong>Nome próprio</strong> apenasleitura
pt_br: <strong> Nome </strong> somente leitura
ru_ru: <strong>Имя</strong> (только чтение)
sl_si: <strong>Ime</strong> samo branje
uk: <strong>Ім'я</strong> лише для читання

# plugins.generic.openid.settings.step2.connect.desc
source: If this journal is new and has no existing user accounts, you can check this box to disable the account linking function. In this case the user will only be asked for additional details required by this application when registering an account via an OpenID provider.
cs_cz: Pokud je tento časopis nový a nemá žádné stávající uživatelské účty, můžete zaškrtnutím tohoto políčka deaktivovat funkci propojení účtů. V takovém případě bude uživatel při registraci účtu prostřednictvím poskytovatele OpenID požádán pouze o další podrobnosti požadované touto aplikací.
da: Hvis dette tidsskrift er nyt og ikke har nogen eksisterende brugerkonti, kan du markere dette felt for at deaktivere kontoforbindelsesfunktionen. I dette tilfælde bliver brugeren kun bedt om yderligere oplysninger påkrævet af denne applikation, når han registrerer en konto via en OpenID-udbyder.
de: Wenn dieses Journal neu ist und keine bestehenden Benutzerkonten hat, können Sie dieses Kontrollkästchen aktivieren, um die Account-Verknüpfungsfunktion zu deaktivieren. In diesem Fall wird der Benutzer nur bei der Registrierung eines Kontos über einen OpenID-Anbieter nach zusätzlichen, von dieser App benötigten Angaben gefragt.
es: Si la revista es nueva y no tiene cuentas de usuario/a, puede marcar esta casilla para desactivar la función de enlace de cuentas. En este caso, al usuario/a solo se le pedirán los detalles adicionales requeridos por la aplicación cuando se registre a través del proveedor OpenID.
hy: Եթե այս ամսագիրը նոր է և չունի գոյություն ունեցող օգտատերերի հաշիվներ, կարող եք նշել այս վանդակը՝ հաշիվների միացման գործառույթն անջատելու համար: Այս դեպքում օգտատերից կպահանջվեն միայն լրացուցիչ մանրամասներ, որոնք պահանջվում են այս հավելվածի կողմից OpenID մատակարարի միջոցով հաշիվ գրանցելիս:
mk_mk: Ако е ова списание ново и нема постоечки кориснички акаунт, може да ја означите оваа коцка за да се оневозможи функцијата поврзување на акаунти. Во тој случај корисникот само ќе биде запрашан за дополнителни детали потребни за оваа апликација кога ќе се регистрира акаунт преку ОпнИД обезбедувачот.
pt: Se esta revista for nova ou não tiver contas de utilizador, pode ativar esta caixa de seleção para desativar a função de ligar contas. Neste caso apenas será solicitado ao utilizador detalhes adicionais obrigatórios por esta aplicação quando registar uma conta através de um fornecedor de OpenID.
pt_br: Se esta revista for nova e não tiver contas de usuário existentes, você pode marcar esta caixa para desativar a função de vinculação de contas. Neste caso, o usuário só será solicitado a fornecer detalhes adicionais exigidos por este aplicativo ao registrar uma conta por meio de um provedor OpenID.
ru_ru: Если этот журнал новый и не содержит ранее созданных учётных записей пользователей, Вы можете включить этот параметр, чтобы отключить функцию связывания учётных записей. В этом случае при регистрации учётной записи через провайдера OpenID пользователя спросят только о дополнительной информации, необходимой этому приложению.
sl_si: Če je revija nova in še nima obstoječih uporabnikov, lahko s to opcijo izključite funkcijo povezovanja računov. V tem primeru bo uporabnik ob registraciji preko OpenID računa naprošen le za vnos dodatnih podatkov, ki so zahtevani za uporabo te aplikacije.
uk: Якщо журнал новий і не має наявних облікових записів користувачів, можна відмітити цю позначку, щоб вимкнути функцію пов'язування облікових записів. У цьому випадку користувача запитають лише додаткові дані, необхідні цій програмі, під час реєстрації облікового запису через постачальника OpenID.

# plugins.generic.openid.settings.hashSecret.desc
source: If you want to encrypt the OpenID information like the OpenID identifier in the HTML code and you want to use the following function for the automated API-KEY generation, you have to enter a secret here. In order to be secure, the secret key should be at least 24 characters.
cs_cz: Pokud chcete zašifrovat informace OpenID, jako je identifikátor OpenID v kódu HTML, a chcete použít následující funkci pro automatizované generování API-KEY, musíte zde zadat tajný klíč. Z důvodu zabezpečení by měl mít tajný klíč alespoň 24 znaků.
da: Hvis du vil kryptere OpenID-oplysningerne som f.eks. OpenID-identifikatoren i HTML-koden, og du vil bruge følgende funktion til den automatiserede generering af API-Nøgle, skal du indtaste en hemmelig nøgle her. For at være sikker skal den hemmelige nøgle bestå af mindst 24 tegn.
de: Wenn Sie die OpenID-Informationen wie den OpenID-Bezeichner im HTML-Code verschlüsseln und die folgende Funktion für die automatische API-KEY-Generierung verwenden möchten, müssen Sie hier ein Secret eingeben. Um sicher zu sein, sollte der Secret Key mindestens 24 Zeichen lang sein.
es: Si desea encriptar información de OpenID, como el identificador OpenID en el código HTML, y quiere usar la siguiente función para la generación automática de la clave API, deberá introducir aquí la contraseña secreta. Para que la clave secreta (secret key) sea segura, esta deberá tener como mínimo 24 caracteres.
hy: Եթե ցանկանում եք գաղտնագրել OpenID-ի տեղեկատվությունը, ինչպիսին է OpenID նույնացուցիչը HTML կոդի մեջ և ցանկանում եք օգտագործել հետևյալ գործառույթը ավտոմատացված API-KEY սերնդի համար, ապա այստեղ պետք է գաղտնիք մուտքագրեք: Ապահով լինելու համար գաղտնի բանալին պետք է լինի առնվազն 24 նիշ:
mk_mk: Доколку сакате да ги енкриптирате ОпенИД информациите како идентификаторот на ОпенИД во ХТМЛ кодот и сакате да ги користите следните функции за автоматско генерирање на АПИ клуч, мора да внесете таен клуч тука. Со цел да биде безбеден, тајниот клуч треба да има барем 24 карактери.
pt: Se deseja encriptar a informação OpenID tal como o identificador OpenID no código HTML e deseja utilizar a seguinte função para a geração automática de uma API-KEY, tem de inserir um segredo aqui. Para ser seguro, a chave secreta deve ter pelo menos 24 caracteres.
pt_br: Se você deseja criptografar as informações OpenID como o identificador OpenID no código HTML e deseja usar a seguinte função para a geração automática de API-KEY, é necessário inserir um segredo aqui. Para ser segura, a chave secreta deve ter pelo menos 24 caracteres.
ru_ru: Если Вы хотите шифровать информацию OpenID, например, идентификатор OpenID в HTML-коде и хотите использовать следующую функцию для автоматической генерации ключа API, Вам необходимо ввести здесь секретный ключ. Чтобы быть надёжным, ключ должен содержать не менее 24 символов.
sl_si: Če želite uporabiti enkriptirane OpenID podatke, kot je recimo OpenID identifikator, v HTML kodi in želite uporabiti naslednjo funkcijo za avtomatsko generiranje API ključa, potem morate tu vnesti secret. Da bo dovolj varen, mora biti dolg vsaj 24 znakov.
uk: Якщо ви хочете зашифрувати інформацію OpenID, таку як ідентифікатор OpenID, в HTML-коді і хочете використовувати таку функцію для автоматичної генерації API-KEY, тут вам потрібно ввести секрет. Для того щоб бути захищеним, секретний ключ повинен містити не менше 24 символів.

# plugins.generic.openid.error.openid.connect.desc.key
source: <strong>An error occurred while verifying your data.</strong><br />The service may not be available right now.<br />Please try again later and <a href='mailto:{$supportEmail}'>contact technical support</a> if the problem still exists.
cs_cz: <strong>Při ověřování vašich údajů došlo k chybě. </strong><br />Služba nemusí být právě teď k dispozici.<br />Zkuste to, prosím, znovu později a <a href='mailto:{$supportEmail}'> pokud problém přetrvává, kontaktujte technickou podporu </a>.
da: <strong>Der opstod en fejl under verificering af dine data.</strong><br />Tjenesten er muligvis ikke tilgængelig lige nu.<br />Prøv igen senere og <a href='mailto:{$supportEmail}'>kontakt teknisk support</a>, hvis problemet fortsætter.
de: <strong>Bei der Überprüfung Ihrer Daten ist ein Fehler aufgetreten.</strong><br />Der Dienst ist möglicherweise im Moment nicht verfügbar.<br />Bitte versuchen Sie es später noch einmal und kontaktieren Sie den <a href='mailto:{$supportEmail}'>Technischen Support</a>, wenn das Problem weiterhin besteht.
es: <strong>Se produjo un error mientras se verificaban sus datos.</strong><br />Puede que el servicio no esté disponible en estos momentos.<br />Inténtelo de nuevo más tarde y <a href='mailto:{$supportEmail}'>contacte con el soporte técnico</a> si el problema persiste.
hy: <strong>Ձեր տվյալները ստուգելիս սխալ է տեղի ունեցել:</strong><br />Ծառայությունը կարող է հասանելի չլինել հենց հիմա:<br />Խնդրում ենք փորձել ավելի ուշ և <a href='mailto:{$supportEmail}'> կապվեք տեխնիկական աջակցության հետ</a> եթե խնդիրը դեռ գոյություն ունի:
mk_mk: <strong>Настана грешка при проверка на вашите податоци.</strong><br />Услугата можеби не е достапна во моментов.<br />Обидете се подоцна и <a href='mailto:{$supportEmail}'>контактирајте ја техничката поддршка</a> доколку проблемот се уште постои.
pt: <strong>Ocorreu um erro ao verificar os seus dados.</strong><br />O serviço pode estar indisponível de momento.<br />Tente novamente mais tarde e Please try again later and <a href='mailto:{$supportEmail}'>contacte o apoio técnico</a> se o problema persistir.
pt_br: <strong> Ocorreu um erro ao verificar seus dados. </strong> <br /> O serviço pode não estar disponível agora. <br /> Por favor, tente novamente mais tarde e <a href='mailto:{$supportEmail}'> entre em contato com o suporte técnico </a> se o problema persistir.
ru_ru: <strong>Произошла ошибка при проверке Ваших данных.</strong><br />Служба может быть недоступна в данный момент.<br />Пожалуйста, попробуйте ещё раз позже и <a href='mailto:{$supportEmail}'>свяжитесь с технической поддержкой</a>, если проблема по-прежнему сохраняется.
sl_si: <strong>Prišlo je do napake pri preverjanju vaših podatkov.</strong><br />Morda storitev ta trenutek ni na voljo.<br />Prosimo, poskusite kasneje in če se bo težava ponavljala <a href='mailto:{$supportEmail}'>o tem obvestite tehnično podporo</a>.
uk: <strong>Під час перевірки даних сталася помилка.</strong><br />Послуга може бути недоступна прямо зараз.<br />Повторіть спробу пізніше та <a href='mailto:{$supportEmail}'>зверніться до служби технічної підтримки</a>, якщо проблема все ще існує.
