Repository: pkp/openid
Catalog: locale/*/locale.po
Languages: cs_cz, da, de, es, fr_ca, hy, mk_mk, pt, pt_br, ru_ru, sl_si, uk

# plugins.generic.openid.settings.generateAPIKey.check
source: Enable automatic API key generation
cs_cz: Povolit automatické generování klíče API
da: Aktivér automatisk generering af API-nøgler
de: Automatische API-Schlüsselgenerierung einschalten
es: Activar la generación automatizada de la clave API
hy: Միացնել API բանալիների ինքնաշխատ ստեղծումը
mk_mk: Овозможува создавање АПИ клуч
pt: Ativar gerar automaticamente a API key
pt_br: Ativar geração automática de chave de API
ru_ru: Включить автоматическую генерацию ключа API
sl_si: Omogoči avtomatsko generiranje API ključa
uk: Увімкнути автоматичне генерування ключів API

# plugins.generic.openid.settings.features.disable.family
source: <strong>Family name</strong> readonly
cs_cz: <strong>Příjmení</strong> pouze pro čtení
da: <strong>Efternavn</strong> readonly
de: <strong>Nachname schreibgeschützt</strong>
es: <strong>Apellidos</strong> solo de lectura
hy: <strong>Ազգանուն</strong> միայն կարդալ
mk_mk: <strong>Презиме</strong> само за читање
pt: <strong>Apelido</strong> apenasleitura
pt_br: <strong> Sobrenome </strong> somente leitura
ru_ru: <strong>Фамилия</strong> (только чтение)
sl_si: <strong>Priimek</strong> samo branje
uk: <strong>Прізвище</strong> лише для читання

# plugins.generic.openid.settings.features.disable.email
source: <strong>Email</strong> readonly
cs_cz: <strong>Email</strong> pouze pro čtení
de: <strong>E-Mail-Adresse schreibgeschützt</strong>
es: <strong>Correo electrónico</strong> solo de lectura
hy: <strong>Էլ. փոստ</strong> միայն կարդալ
mk_mk: <strong>Имејл</strong> само за читање
pt: <strong>E-mail</strong> apenasleitura
pt_br: <strong> E-mail </strong> somente leitura
ru_ru: <strong>Адрес электронной почты</strong> (только чтение)
sl_si: <strong>Email</strong> samo branje
uk: <strong>Електронна пошта</strong> лише для читання

# plugins.generic.openid.error.openid.disabled.without
source: <strong>This account is disabled without any specific reason.</strong><br />Please <a href='mailto:{$supportEmail}'>contact technical support</a> to enable this account.
cs_cz: <strong>Tento účet je deaktivován bez udání konkrétního důvodu.</strong><br />Chcete-li tento účet aktivovat, <a href='mailto:{$supportEmail}'>kontaktujte technickou podporu</a>.
da: <strong>Denne konto er deaktiveret uden nogen specifik grund.</strong><br /> <a href='mailto:{$supportEmail}'>Kontakt teknisk support</a> for at aktivere denne konto.
de: <strong>Dieses Konto wurde ohne Angabe eines bestimmten Grundes deaktiviert.</strong><br />Bitte kontaktieren Sie den <a href='mailto:{$supportEmail}'>Technischen Support</a>, um den Account zu reaktivieren.
es: <strong>Esta cuenta se ha desactivado sin ningún motivo específico. Para activar la cuenta, </strong><br /><a href='mailto:{$supportEmail}'>contacte con el soporte técnico</a>.
hy: <strong>Այս հաշիվն անջատված է առանց որևէ կոնկրետ պատճառի:</strong><br />Սեղմեք <a href='mailto:{$supportEmail}'>կապվեք տեխնիկական աջակցության հետ</a> այս հաշիվը միացնելու համար:
mk_mk: <strong>Овој акаунт е оневозможен без специфична причина.</strong><br />Ве молиме <a href='mailto:{$supportEmail}'>контактирајте ја техничката поддршка</a> за да го овозможите овој акаунт.
pt: <strong>Esta conta encontra-se desativada sem razão específica.</strong><br />Por favor <a href='mailto:{$supportEmail}'>contacte o apoio técnico</a> para ativar esta conta.
pt_br: <strong> Esta conta foi desativada sem qualquer motivo específico. </strong> <br /> Por favor, <a href='mailto:{$supportEmail}'> contate o suporte técnico </a> para ativar esta conta.
ru_ru: <strong>Эта учётная запись отключена без указания конкретной причины.</strong><br />Пожалуйста, <a href='mailto:{$supportEmail}'>свяжитесь с технической поддержкой</a>, чтобы включить данную учётную запись.
sl_si: <strong>Ta račun je onemogočen, brez podatkov o tem zakaj.</strong><br />Prosimo <a href='mailto:{$supportEmail}'>obrnite se na tehnično pomoč</a> za ponovno omogočanje tega računa.
uk: <strong>Цей обліковий запис вимкнено без будь-якої конкретної причини.</strong><br />Будь ласка, <a href='mailto:{$supportEmail}'>зверніться до служби технічної підтримки</a>, щоб увімкнути цей обліковий запис.

# plugins.generic.openid.error.legacy.link
source: Managers and support staff can sign in via this <a href="{$legacyLoginUrl}">link</a> to solve this issue.
cs_cz: Správci a pracovníci podpory se mohou k řešení tohoto problému přihlásit pomocí tohoto <a href="{$legacyLoginUrl}">odkazu</a>.
da: Ledere og supportmedarbejdere kan logge ind via dette <a href="{$legacyLoginUrl}"> link </a> for at løse dette problem.
de: Manager und Support-Mitarbeiter können sich <a href="{$legacyLoginUrl}">hier</a> anmelden, um dieses Problem zu lösen
es: Para resolver el problema, los administradores/as y el personal de soporte pueden iniciar sesión a través de este <a href="{$legacyLoginUrl}">enlace</a>.
hy: Կառավարիչները և աջակցման անձնակազմը կարող են մուտք գործել այս <a href="{$legacyLoginUrl}">հղման</a> միջոցով՝ այս խնդիրը լուծելու համար:
mk_mk: Менаџери и персонал за поддршка може да се пријават преку овој <a href="{$legacyLoginUrl}">линк</a> за да го решат овој проблем.
pt: Gestores e pessoal de apoio podem aceder através deste <a href="{$legacyLoginUrl}">link</a>para resolver este problema.
pt_br: Gerentes e equipe de suporte podem se inscrever por meio deste <a href="{$legacyLoginUrl}"> link </a> para resolver este problema.
ru_ru: Менеджеры и сотрудники службы поддержки могут войти в систему по этой <a href="{$legacyLoginUrl}">ссылке</a>, чтобы решить возникшую проблему.
sl_si: Upravniki in podporno osebje se lahko prijavi preko te <a href="{$legacyLoginUrl}">povezave</a>, da razreši težave.
uk: Менеджери та допоміжний персонал можуть увійти за допомогою цього <a href="{$legacyLoginUrl}">посилання</a>, щоб вирішити цю проблему.

# plugins.generic.openid.select.legacy
source: Sign in with your account at {$journalName}
cs_cz: Přihlaste se pomocí svého účtu v časopisu {$ journalName}
da: Log ind med din konto på {$journalName}
de: Über meinen {$journalName} Account anmelden
es: Iniciar sesión con su cuenta en {$journalName}
hy: Մուտք գործեք ձեր {$journalName} հաշիվ
mk_mk: Запиши се со твојот акаунт на {$journalName}
pt: Entre com a sua conta em {$journalName}
pt_br: Faça login com sua conta em {$journalName}
ru_ru: Войти в систему с Вашей учётной записью в « {$journalName}»
sl_si: Prijava z vašim računom v {$journalName}
uk: Увійдіть за допомогою свого облікового запису для "{$journalName}"

# plugins.generic.openid.select.provider.login
source: Sign in with
es: Iniciar sesión con

# plugins.generic.openid.select.provider.help
source: Sign in or register with:
cs_cz: Přihlaste se nebo se zaregistrujte pomocí:
da: Log ind eller registrer med:
de: Anmelden oder registrieren über:
es: Iniciar sesión o registrarse con:
hy: Մուտք գործեք կամ գրանցվեք հետևյալով:
mk_mk: Запиши се или регистрирај се со:
pt: Aceda ou registe-se em:
pt_br: Faça login ou registre-se com:
ru_ru: Войти в систему или зарегистрироваться с помощью:
sl_si: Prijava ali registracija z:
uk: Увійдіть або зареєструйтеся за допомогою:

# plugins.generic.openid.select.provider.custom
source: Sign in with custom provider
cs_cz: Přihlaste se pomocí vlastního poskytovatele
da: Log ind med brugerdefineret udbyder
de: Über benutzerdefinierten Provider anmelden
es: Iniciar sesión con un proveedor personalizado
hy: Մուտք գործեք հատուկ մատակարարի հետ
mk_mk: Запиши се со избран обезбедувач
pt: Aceda com o fornecedor personalizado
pt_br: Faça login com um provedor personalizado
ru_ru: Войти в систему с помощью пользовательского провайдера
sl_si: Prijava s ponudnikom po meri
uk: Увійти через настроюваного постачальника

# plugins.generic.openid.select.provider.orcid
source: Sign in with Orcid
cs_cz: Přihlaste se pomocí účtu ORCID
da: Log ind med Orcid
de: Über Orcid anmelden
es: Iniciar sesión con ORCID
hy: Մուտք գործեք Orcid-ի միջոցով
mk_mk: Запиши се со Orcid
pt: Aceda com o ORCID
pt_br: Faça login com Orcid
ru_ru: Войти в систему с помощью Orcid
sl_si: Prijava z Orcid računom
uk: Увійти через ORCID

# plugins.generic.openid.select.provider.google
source: Sign in with Google
cs_cz: Přihlaste se pomocí účtu Google
da: Log ind med Google
de: Über Google anmelden
es: Iniciar sesión con Google
hy: Մուտք գործեք Google-ով
mk_mk: Запиши се со Google
pt: Aceda com o Google
pt_br: Faça login no Google
ru_ru: Войти в систему с помощью Google
sl_si: Prijava z Google računom
uk: Увійти через Google

# plugins.generic.openid.select.provider.microsoft
source: Sign in with Microsoft
cs_cz: Přihlaste se pomocí účtu Microsoft
da: Log ind med Microsoft
de: Über Microsoft anmelden
es: Iniciar sesión con Microsoft
hy: Մուտք գործեք Microsoft-ով
mk_mk: Запиши се со Microsoft
pt: Aceda com a Microsoft
pt_br: Faça login com a Microsoft
ru_ru: Войти в систему с помощью Microsoft
sl_si: Prijava z Microsoft računom
uk: Увійти через Microsoft

# plugins.generic.openid.select.provider.apple
source: Sign in with Apple
cs_cz: Přihlaste se pomocí účtu Apple
da: Log ind med Apple
de: Über Apple anmelden
es: Iniciar sesión con Apple
hy: Մուտք գործեք Apple-ով
mk_mk: Запиши се со Apple
pt: Aceda com a Apple
pt_br: Faça login com a Apple
ru_ru: Войти в систему с помощью Apple
sl_si: Prijava z Apple računom
uk: Увійти через Apple

# plugins.generic.openid.select.provider.legacyRegister
source: Register Account (without Oauth)
da: Registrer konto (uden Oauth)
de: Ohne Oauth registrieren
es: Registrar cuenta (sin Oauth)
hy: Գրանցել հաշիվ (առանց Oauth -ի)
pt: Registar conta (sem Oauth)
pt_br: Registrar conta (sem Oauth)
uk: Зареєструвати обліковий запис (без Oauth)

# plugins.generic.openid.disables.fields.info.orcid
source: The ORCID is automatically provided by your authenticated ORCID account.
cs_cz: ORCID poskytuje automaticky váš ověřený účet ORCID.
da: ORCID leveres automatisk af din godkendte ORCID-konto.
de: ORCID wird automatisch von Ihrem authentifizierten ORCID-Konto bereitgestellt.
es: Su cuenta ORCID autenticada proporciona automáticamente el ORCID.
hy: ORCID-ն ինքնաշխատ կերպով տրամադրվում է ձեր վավերացված ORCID հաշվի կողմից:
mk_mk: ОРЦИД е автоматски обезбеден преку вашиот проверен ОРЦИД акаунт.
pt: O ORCID is fornecido automaticamente pela sua conta autenticada ORCID.
pt_br: O ORCID é fornecido automaticamente por sua conta ORCID autenticada.
ru_ru: ORCID автоматически предоставлен Вашей авторизованной учётной записью ORCID.
sl_si: ORCID je avtomatično prenesen iz vašega uporabljenega ORCID računa.
uk: ORCID автоматично надається вашим автентифікованим обліковим записом ORCID.

# plugins.generic.openid.disables.fields.info.api
source: The API key is automatically generated by a plugin.
cs_cz: Klíč API je automaticky generován pluginem.
da: API-nøglen genereres automatisk af et plugin.
de: Der API-key wird automatisch von einem Plugin generiert.
es: Un módulo genera automáticamente la clave API.
hy: API բանալին ինքնաշխատ կերպով ստեղծվում է plugin-ի կողմից:
mk_mk: АПИ клучот автоматски се создава од плагин.
pt: A API key é automaticamente gerada pelo plugin.
pt_br: A chave API é gerada automaticamente por um plugin.
ru_ru: Ключ API автоматически сгенерирован плагином.
sl_si: Vtičnik avtomatsko generira API ključ.
uk: Ключ API автоматично генерується плагіном.

# plugins.generic.openid.disables.fields.info.password
source: You are using a single sign-on authentication provider to log in, so you must change your password on the provider's account page.
cs_cz: K přihlášení používáte poskytovatele ověřování pomocí jednotného přihlášení, takže musíte změnit své heslo na stránce účtu poskytovatele.
da: Du bruger en enkelt login-godkendelsesudbyder til at logge ind, så du skal ændre din adgangskode på udbyderens kontoside.
de: Sie verwenden einen single-sign-on Authentifizierungsprovider, um sich anzumelden, daher müssen Sie Ihr Passwort auf der Kontoseite des Anbieters ändern.
es: Está utilizando un proveedor de autenticación única (SSO) para iniciar la sesión, por lo que debe cambiar su contraseña en la página de la cuenta del proveedor.
hy: Մուտք գործելու համար դուք օգտագործում եք մեկ մուտքի վավերացման մատակարար, ուստի պետք է փոխեք ձեր գաղտնաբառը մատակարարի հաշվի էջում:
mk_mk: Користите провајдер со проверка за единечна пријава како би се најавиле, затоа мора да ја промените вашата лозинка на корисничката страница на провајдерот.
pt: Está a utilizar um fornecedor de autenticação única para entrar, portanto deve alterar a sua senha na página da conta do fornecedor.
pt_br: Você está usando um provedor de autenticação de logon único para fazer login, portanto, deve alterar sua senha na página da conta do provedor.
ru_ru: Вы используете для входа в систему провайдера, обеспечивающего единый вход (SSO), поэтому Вы должны изменить свой пароль на странице учётной записи этого провайдера.
sl_si: Za prijavo uporabljate "single sign-on" ponudnika, zato morate spremeniti geslo na strani vašega ponudnika.
uk: Для входу ви використовуєте постачальника автентифікації єдиного входу, тому потрібно змінити пароль на сторінці облікового запису цього постачальника.

# plugins.generic.openid.settings.provider.microsoft.audience
source: Choose the audience setting that corresponds to the Azure Authentication service that you are currently using
da: Vælg brugerindstillingen der svarer til Azure Authentication servicen som du pt. bruger
es: Escoja los ajustes de audiencia que corresponden con el servicio Azure Authentication que esté utilizando actualmente
hy: Ընտրեք լսարանի կարգավորումը, որը համապատասխանում է Azure Authentication ծառայությանը, որն այժմ օգտագործում եք
pt: Escolha a configuração de público que corresponde ao serviço de autenticação do Azure que está a usar atualmente
pt_br: Escolha a configuração de público que corresponde ao serviço de autenticação do Azure que você está usando atualmente
uk: Виберіть параметр аудиторії, який відповідає службі автентифікації Azure, яку ви зараз використовуєте

# plugins.generic.openid.step2.headline.siteNameMissing
source: Do you already have an account?
da: Har du allerede en konto?
de: Haben Sie bereits einen Account?
es: ¿Ya tiene una cuenta?
hy: Դուք արդեն ունե՞ք հաշիվ:
pt: Já tem uma conta?
pt_br: Você já tem uma conta?
uk: Ви вже маєте обліковий запис?

# plugins.generic.openid.step2.choice.no.siteNameMissing
source: No, I'm new to this Site.
da: Nej, jeg er ny.
de: Nein, ich bin neu hier.
es: No, soy nuevo/a.
hy: Ոչ, ես նորեկ եմ:
pt: Não, sou novo.
pt_br: Não, sou novo.
uk: Ні, я новачок.

# plugins.generic.openid.step2.help.siteNameMissing
source: Additional information is required to register:
da: Yderligere information er nødvendig for at kunne registrere sig:
de: Für die Registrierung werden weitere Informationen benötigt:
es: Se requiere información adicional para registrarse:
hy: Գրանցվելու համար անհրաժեշտ է լրացուցիչ տեղեկատվություն.
pt: São necessárias informações adicionais para se registar:
pt_br: Informações adicionais são necessárias para se registrar:
uk: Для реєстрації потрібна додаткова інформація:

# plugins.generic.openid.settings.microsoft.enable
source: Microsoft Azure Active Directory
mk_mk: Активен директориум на Microsoft Azure
pt: Diretório de Microsoft Azure Ativo
